"article-fetcher-error-updated-content-timeout" = "Muokkausten n\U00e4ytt\U00e4minen ep\U00e4onnistui, aikakatkaisu. Tarkastele muutoksia my\U00f6hemmin palaamalle t\U00e4lle sivulle.";
"account-creation-logging-in" = "Kirjaudutaan...";
"diff-single-line-format" = "Rivi %1$d";
"button-report-a-bug" = "Ilmoita ongelmasta";
"saved-title" = "Tallennettu";
"appearance-settings-set-automatic-table-opening" = "Luetteloasetukset";
"welcome-languages-search-title" = "Hae yli 300 kielell\U00e4";
"icon-shortcut-random-title" = "Satunnainen artikkeli";
"explore-feed-preferences-show-news-title" = "N\U00e4yt\U00e4 Uutisissa-kortti";
"talk-page-new-reply-success-text" = "Vastauksesi julkaistiin onnistuneesti";
"forgot-password-title" = "Salasanan palauttaminen";
"original-tab-button-popover-description" = "Napauta 'W' -kuvaketta palataksesi v\U00e4lilehdelle josta aloitit";
"places-enable-location-action-button-title" = "Ota sijainti k\U00e4ytt\U00f6\U00f6n";
"reading-lists-list-not-synced-limit-exceeded" = "Luettelo ei synkronoitu, raja saavutettu";
"edit-summary-add-summary-text" = "Lis\U00e4\U00e4 muokkausyhteenveto";
"in-the-news-notification-save-for-later-action-title" = "Tallenna my\U00f6hemm\U00e4ksi";
"empty-insert-media-title" = "Valitse tiedosto";
"places-filter-top-articles-count" = "%1$d|%1$d artikkeli|%1$d artikkelia";
"insert-action-title" = "Lis\U00e4\U00e4";
"dim-images" = "Himmenn\U00e4 kuvia";
"aaald-article-insert-last-updated" = "Viimeksi p\U00e4ivitetty";
"diff-compare-title" = "Versioiden vertailu";
"reference-title" = "L\U00e4hde %1$@";
"button-read-now" = "Lue nyt";
"share-message-format" = "\U201c%1$@\U201d %2$@";
"description-welcome-descriptions-title" = "Artikkelin kuvaukset";
"page-history-compare-title" = "Vertaa";
"description-help-wikidata-guide" = "Wikidata-opas kuvausten kirjoittamiseen";
"reading-list-sync-enable-subtitle" = "Tallennetut artikkelisi ja lukulistasi voidaan nyt tallentaa Wikipedia-tunnuksellesi ja synkronoida Wikipedia-sovellusten v\U00e4lill\U00e4.";
"diff-context-lines-collapsed-button-title" = "N\U00e4yt\U00e4";
"reverted-edit-back-to-article-button-title" = "Takaisin artikkeliin";
"explore-feed-preferences-turn-off-explore-tab-message" = "Tutki-v\U00e4lilehti voidaan ottaa uudelleen k\U00e4ytt\U00f6\U00f6n Tutki-sy\U00f6tteen asetuksissa";
"field-username-title" = "K\U00e4ytt\U00e4j\U00e4nimi";
"potd-empty-error-description" = "Virhe haettaessa p\U00e4iv\U00e4n kuvaa %1$@";
"action-share" = "Jaa";
"insert-media-image-position-setting-left" = "Vasen";
"two-factor-login-continue" = "Jatka sis\U00e4\U00e4nkirjautumista";
"aaald-error-subitle" = "P\U00e4ivit\U00e4 yritt\U00e4\U00e4ksesi uudelleen";
"page-protected-autoconfirmed" = "T\U00e4m\U00e4 sivu on osittain suojattu.";
"nearby-distance-label-miles" = "%1$@ mailia";
"settings-storage-and-syncing-erase-saved-articles-footer-text" = "T\U00e4h\U00e4n laitteeseen ja k\U00e4ytt\U00e4j\U00e4tunnuksellesi tallennetut artikkelit poistetaan, vaikka synkronointi olisi kytketty p\U00e4\U00e4lle.\n\nTallennustilaa vapautuu noin %1$@.";
"aaald-new-news-reference-title" = "Uutiset";
"about-translators-details" = "K\U00e4\U00e4nn\U00f6sty\U00f6n tehneet vapaaehtoiset sivustolla %1$@";
"abuse-filter-warning-spam" = "Asiattoman sis\U00e4ll\U00f6n lis\U00e4\U00e4minen artikkeleihin";
"diff-paragraph-moved-format" = "Kappale siirretty %2$@ %1$@";
"share-on-twitter-sign-off" = "@Wikipedia'n kautta";
"continue-reading-empty-description" = "Tutki Wikipediaa l\U00f6yt\U00e4\U00e4ksesi lis\U00e4\U00e4 luettavia artikkeleja";
"replace-buttons-replace-accessibility" = "Korvaa yksitt\U00e4inen instanssi";
"action-update" = "P\U00e4ivit\U00e4";
"notifications-center-status-read" = "Luettu";
"settings-title" = "Asetukset";
"diff-paragraph-moved" = "Kappale siirretty";
"empty-no-reading-lists-title" = "J\U00e4rjest\U00e4 tallennetut artikkelit lukulistoilla";
"settings-search-footer-text" = "Vaihda sovelluksen avausn\U00e4kym\U00e4ksi Haku-v\U00e4lilehti Tutki-v\U00e4lilehden sijaan";
"empty-no-history-message" = "Pid\U00e4 kirjaa lukemistasi artikkeleista";
"settings-storage-and-syncing-show-default-reading-list-title" = "N\U00e4yt\U00e4 tallennetut lukulistat";
"insert-link-title" = "Lis\U00e4\U00e4 linkki";
"history-clear-all" = "Tyhjenn\U00e4";
"app-store-subtitle" = "Vapaa tietosanakirja";
"aaald-added-text-description-2" = "%1$@ lis\U00e4tty";
"settings-notifications-system-turn-on" = "Ota ilmoitukset k\U00e4ytt\U00f6\U00f6n";
"talk-page-title-article-talk" = "artikkelikeskustelu";
"places-filter-button-title" = "Suodata";
"nearby-distance-label-feet" = "%1$@ jalkaa";
"notifications-center-filters-types-item-title-all" = "Kaikki tyypit";
"explore-main-page-description" = "Wikimedia projektin etusivu";
"description-welcome-concise-title" = "Pid\U00e4 se lyhyen\U00e4";
"edit-minor-learn-more-text" = "Lue lis\U00e4\U00e4 pienist\U00e4 muutoksista";
"welcome-exploration-on-this-day-description" = "Matkusta takaisin ajassa ja opi mit\U00e4 tapahtui t\U00e4n\U00e4 p\U00e4iv\U00e4n\U00e4 historiassa";
"description-welcome-descriptions-sub-title" = "Artikkelin yhteenveto helpottaa sis\U00e4ll\U00f6n hahmottamista nopealla vilauksella";
"article-deleted-accessibility-notification" = "%1$d|artikkeli|artikkelia poistettu";
"edit-indent-accessibility-label" = "Lis\U00e4\U00e4 valitun rivin sisennyst\U00e4";
"edit-reference-remove-accessibility-label" = "Poista viitesyntaksi";
"diff-thanks-send-subtitle" = "Kiitoksen l\U00e4hett\U00e4minen on helppo tapa arvostaa toisen k\U00e4ytt\U00e4j\U00e4n panosta Wikipedian kehitt\U00e4miseen. Toimintoa ei voi perua, ja kiitokset ovat julkisesti n\U00e4ht\U00e4vill\U00e4.";
"about-libraries" = "K\U00e4ytetyt kirjastot";
"edit-menu-item" = "Muokkaa";
"wikitext-preview-save-changes-title" = "Tallenna muutokset";
"insert-media-caption-title" = "Kuvateksti";
"explore-random-article-sub-heading-from-language-wikipedia" = "Wikipedian kieliversiosta %1$@";
"empty-no-search-results-message" = "Tuloksia ei l\U00f6ytynyt";
"insert-media-image-size-setting-custom" = "Mukautettu";
"intermediate-edits-count-limited" = "%1$d+ v\U00e4liss\U00e4 olevaa versiota ei n\U00e4ytet\U00e4";
"languages-wikipedia" = "Wikipedian kielet";
"notifications-center-header-notice-from-project" = "Ilmoitus projektista %1$@";
"edit-italic-remove-accessibility-label" = "Poista kursivoitu muotoilu";
"notifications-center-subheader-message-user-talk-page" = "Viesti keskustelusivullasi";
"reading-list-with-provided-name-not-found" = "Lukulistaa nimell\U00e4 \U201c%1$@\U201d ei l\U00f6ytynyt. Varmista, ett\U00e4 sinulle on oikea nimi.";
"reverted-edit-possible-reasons" = "- Muutoksesi ei noudata yht\U00e4 suuntaviivoista. %1$@ \n\n - Muutoksesi n\U00e4ytt\U00e4\U00e4 kokeilulta tai vandalismilta";
"settings-clear-cache" = "Tyhjenn\U00e4 v\U00e4limuisti";
"notifications-center-subheader-user-rights-change" = "K\U00e4ytt\U00e4j\U00e4oikeuksien muutos";
"share-social-mention-format" = "\U201c%1$@\U201d @Wikipedian kautta: %2$@";
"icon-shortcut-nearby-title" = "L\U00e4hell\U00e4 olevat artikkelit";
"explore-enable-location-title" = "Tutki artikkeleita l\U00e4hell\U00e4 nykyist\U00e4 sijaintisi";
"explore-most-read-more-list-title-for-date" = "Parhaimmistoa %1$@";
"talk-page-add-discussion-accessibility-label" = "Lis\U00e4\U00e4 keskustelu";
"explore-feed-preferences-continue-reading-description" = "Pikalinkki takaisin avoimeen artikkeliin";
"action-find-in-page" = "Etsi sivulta";
"no-email-account-alert" = "Asenna s\U00e4hk\U00f6postitili laitteeseesi ja yrit\U00e4 uudelleen.";
"search-recent-title" = "Viimeisimm\U00e4t haut";
"table-of-contents-subheading-label" = "Alaotsikko %1$d";
"widget-onthisday-description" = "Tutki mit\U00e4 t\U00e4n\U00e4 p\U00e4iv\U00e4n\U00e4 on tapahtunut historiassa.";
"appearance-settings-image-dimming-footer" = "Pienenn\U00e4 kuvien sameutta tummassa ja mustassa teemassa";
"on-this-day-detail-header-date-range" = "%1$@ - %2$@";
"article-delete" = "Poista";
"search-recent-clear-confirmation-heading" = "Poistetaanko kaikki \U00e4skett\U00e4iset haut?";
"table-of-contents-close-accessibility-hint" = "Sulje";
"search-field-placeholder-text" = "Wikipedia-haku";
"insert-media-image-type-setting-thumbnail" = "Pienoiskuva";
"diff-multi-line-format" = "Rivit %1$d-%2$d";
"empty-no-reading-lists-message" = "Luo lukulistoja matkustettaville paikoille, suosikkiartikkeleille ja paljon enemm\U00e4n";
"edit-link-display-text-title" = "N\U00e4yt\U00e4 teksti";
"insert-media-image-preview-more-information-action-title" = "Lis\U00e4tietoja";
"reading-list-list-limit-exceeded-message" = "T\U00e4t\U00e4 lukulistaa tai siin\U00e4 olevia artikkeleita ei synkronoida; siin\U00e4 olevien listojen m\U00e4\U00e4r\U00e4\U00e4 tulee v\U00e4hent\U00e4\U00e4 (raja %1$d), jotta synkronointia voidaan jatkaa.";
"reading-list-unable-to-add-entry" = "Lukulistamerkinn\U00e4n lis\U00e4\U00e4minen ep\U00e4onnistui. Yrit\U00e4 my\U00f6hemmin uudelleen.";
"share-a-fact-made-with" = "Tehty Wikipedia-sovelluksen avulla";
"account-creation-log-in" = "Kirjaudu sis\U00e4\U00e4n.";
"description-add-title" = "Lis\U00e4\U00e4 kuvaus";
"find-previous-button-accessibility" = "Edellinen hakutulos";
"wikitext-upload-save-sign-in" = "Kirjaudu sis\U00e4\U00e4n";
"main-menu-about" = "Tietoja sovelluksesta";
"description-help-about-title" = "Tietoja";
"diff-compare-header-to-info-heading" = "Muokattu:";
"diff-single-header-editor-number-edits-format" = "%1$d|%1$d muokkaus|%1$d muokkausta";
"insert-media-media-settings-title" = "Media-asetukset";
"places-search-top-articles" = "Kaikki huippuartikkelit";
"places-search-did-you-mean" = "Tarkoititko %1$@?";
"action-saved-accessibility" = "Tallennettu. Aktivoi poistaaksesi.";
"aaald-new-discussion" = "Uusi keskustelu";
"field-alert-username-unavailable" = "K\U00e4ytt\U00e4j\U00e4nimi ei ole saatavilla";
"wikitext-preview-link-not-found-preview-description" = "Wikipediassa ei ole t\U00e4m\U00e4nnimist\U00e4 artikkelia";
"reading-lists-article-not-synced" = "Ei synkronoitu";
"page-history-stats-text" = "%1$d|%1$d muokkaus|%1$d muokkausta vuoden %2$@ j\U00e4lkeen";
"empty-no-feed-action-message" = "Voit silti lukea tallennettuja sivuja";
"image-gallery-unknown-owner" = "Tuntematon tekij\U00e4.";
"explore-feed-preferences-card-hidden-title" = "Kortti piilotettu";
"replace-button-accessibility" = "Suorita %1$@.";
"about-content-license-details-share-alike-license" = "Creative Commons Nime\U00e4-JaaSamoin -lisenssi";
"reading-list-sync-enable-title" = "Otetaanko lukulistan synkronointi k\U00e4ytt\U00f6\U00f6n?";
"explore-feed-preferences-show-randomizer-title" = "N\U00e4yt\U00e4 Satunnaistaminen-kortti";
"explore-feed-preferences-potd-description" = "P\U00e4iv\U00e4n suositeltu kuva Commonsista";
"relative-date-hours-abbreviated" = "%1$d t";
"action-add-to-reading-list-short" = "Lis\U00e4\U00e4 listaan";
"account-creation-create-account" = "Luo k\U00e4ytt\U00e4j\U00e4tunnus";
"places-search-articles-that-match" = "%1$@ vastaa \U201c%2$@\U201d";
"explore-feed-preferences-featured-article-description" = "Suositeltu artikkeli Wikipediassa";
"edit-link-title" = "Muokkaa linkki\U00e4";
"action-unsave" = "Kumoa tallennus";
"notifications-center-subheader-mention-talk-page" = "Maininta keskustelusivulla";
"aaald-revision-by-anonymous" = "Rekister\U00f6itym\U00e4tt\U00f6m\U00e4n k\U00e4ytt\U00e4j\U00e4n muokkaus";
"two-factor-login-title" = "Kirjaudu sis\U00e4\U00e4n k\U00e4ytt\U00e4j\U00e4tunnuksellesi";
"explore-randomizer" = "Satunnaistaminen";
"reading-list-login-or-create-account-button-title" = "Kirjaudu sis\U00e4\U00e4n tai luo tunnus";
"notifications-center-status-all-notifications" = "Kaikki ilmoitukset";
"logged-out-log-back-in-button-title" = "Kirjaudu takaisin tunnuksellesi";
"variants-alert-preferences-button" = "Tarkista asetuksesi";
"page-history-revision-author-accessibility-label" = "Tekij\U00e4: %1$@";
"edit-text-clear-formatting" = "Tyhjenn\U00e4 muotoilu";
"wikitext-preview-link-external-preview-description" = "T\U00e4m\U00e4 linkki ohjaa ulkoiselle sivustolle: %1$@";
"explore-feed-preferences-show-places-footer-text" = "Paikat-kortin poistaminen k\U00e4yt\U00f6st\U00e4 poistaa sen k\U00e4yt\U00f6st\U00e4 kaikilla kielill\U00e4.";
"page-protected-can-not-edit" = "Sinulla ei ole oikeuksia muokata t\U00e4t\U00e4 sivua";
"diff-single-header-subtitle-bytes-added" = "%1$d|%1$d merkki lis\U00e4tty|%1$d merkki\U00e4 lis\U00e4tty";
"explore-feed-preferences-on-this-day-description" = "Tapahtumat historiassa t\U00e4n\U00e4 p\U00e4iv\U00e4n\U00e4";
"search-did-you-mean" = "Tarkoititko %1$@?";
"diff-paragraph-moved-distance-section" = "%1$d|%1$d kappale|%1$d kappaletta";
"settings-clear-cache-are-you-sure-message" = "V\U00e4limuistin tyhjent\U00e4minen vapauttaa %1$@ tilaa. Tallennetut sivut s\U00e4ilytet\U00e4\U00e4n.";
"reading-list-add-hint-title" = "Lis\U00e4\U00e4t\U00e4\U00e4nk\U00f6 \U201c%1$@\U201d lukulistaan?";
"page-history-revisions-comparison-warning" = "Vain kaksi versiota voidaan valita";
"notifications-center-subheader-edit-milestone" = "Muokkausvirstanpylv\U00e4s";
"about-content-license" = "Sis\U00e4lt\U00f6lisenssi";
"about-libraries-licenses-title" = "Me rakastamme avoimia ohjelmistoja %1$@";
"settings-storage-and-syncing-erase-saved-articles-title" = "Poista tallennetut artikkelit";
"app-store-release-notes" = "T\U00e4ysin mukautettava ja helpommin luettava Tutki-sy\U00f6te. Paikallistamista, suorituskykyparannuksia ja bugikorjauksia.";
"article-share" = "Jaa";
"variants-alert-dismiss-button" = "Ei kiitos";
"article-languages-filter-placeholder" = "L\U00f6yd\U00e4 kieli";
"description-help-about-wikidata" = "Tietoja Wikidatasta";
"description-published-button-title" = "Valmis";
"edit-signature-remove-accessibility-label" = "Poista allekirjoituksen syntaksi";
"edit-menu-item-could-not-find-selection-alert-message" = "Valittu teksti ei ole ehk\U00e4 muokattavissa (esimerkiksi artikkelin tai tietolaatikon otsikot) tai olla liian pitk\U00e4.";
"share-social-format" = "\U201c%1$@\U201d Wikipedian kautta: %2$@";
"talk-page-link-user-action-sheet-title" = "K\U00e4ytt\U00e4j\U00e4sivut";
"forgot-password-username-or-email-title" = "tai";
"intermediate-edits-editors-count" = "%1$d|Yht\U00e4 v\U00e4liss\U00e4 olevaa versiota|%1$d v\U00e4liss\U00e4 olevaa versiota %2$d|toisen k\U00e4ytt\U00e4j\U00e4n tekem\U00e4n\U00e4|%2$d k\U00e4ytt\U00e4j\U00e4n tekemin\U00e4 ei n\U00e4ytet\U00e4";
"notifications-center-inbox-wikipedias-section-title" = "Wikipediat";
"empty-no-other-article-languages-message" = "Artikkelia ei ole viel\U00e4 kirjoitettu muilla kielill\U00e4.";
"app-store-short-description" = "Wikipedia-sovelluksella voit tutkia l\U00e4hist\U00f6ll\U00e4 olevia paikkoja, ladata artikkeleita luettavaksi ilman verkkoyhteytt\U00e4 ja mukauttaa lukukokemusta mieleiseksesi.";
"about-repositories-app-source-license" = "L\U00e4hdekoodi on saatavilla %1$@-lisenssin ehtojen mukaisesti.";
"search-button-accessibility-label" = "Etsi Wikipediasta";
"theme-default-display-name" = "Oletus";
"new-password-instructions" = "Olet kirjautunut sis\U00e4\U00e4n v\U00e4liaikaisella salasanalla. Viimeistell\U00e4ksi kirjautumisen aseta uusi salasana t\U00e4ss\U00e4.";
"about-content-license-details" = "Ellei toisin mainita, sis\U00e4lt\U00f6 on saatavilla %1$@ -lisenssill\U00e4.";
"account-creation-saving" = "Tallennetaan...";
"abuse-filter-warning-heading" = "T\U00e4m\U00e4 saattaa olla haitallinen muokkaus. Haluatko varmasti julkaista sen?";
"talk-page-new-reply-body-accessibility-label" = "Kirjoita vastaus";
"find-clear-button-accessibility" = "Tyhjenn\U00e4 etsint\U00e4";
"diff-thanks-send-title" = "Julkinen kiitos l\U00e4hetetty";
"diff-thanks-login-subtitle" = "Kiitoksen l\U00e4hett\U00e4minen on helppo tapa arvostaa toisen k\U00e4ytt\U00e4j\U00e4n panosta Wikipedian kehitt\U00e4miseen. Sinun on oltava kirjautunut sis\U00e4\U00e4n.";
"share-default-format" = "\U201c%1$@\U201d artikkelista \U201c%2$@\U201d: %3$@";
"home-title" = "Tutki";
"explore-feed-preferences-turn-off-feed-disclosure" = "Tutki-v\U00e4lilehden poistaminen k\U00e4yt\U00f6st\U00e4 korvaa sen Asetukset-v\U00e4lilehdell\U00e4.";
"editing-welcome-set-knowledge-free-title" = "Vapauta tieto";
"explore-feed-preferences-turn-off-explore-feed-alert-title" = "Poistetaanko Tutki-sy\U00f6te k\U00e4yt\U00f6st\U00e4?";
"explore-feed-preferences-turn-off-explore-feed-alert-message" = "Kaikkien Tutki-sy\U00f6tteen korttien piilottaminen poistaa n\U00e4kym\U00e4n kokonaan ja korvaa sen Asetukset-n\U00e4kym\U00e4ll\U00e4";
"reading-list-sync-enabled-panel-message" = "Lukulistojen synkronointi on k\U00e4yt\U00f6ss\U00e4 t\U00e4ll\U00e4 tunnuksella. Voit poistaa synkronoinnin k\U00e4yt\U00f6st\U00e4 asetuksissa.";
"explore-feed-preferences-additional-languages-footer-text" = "Valitse k\U00e4ytett\U00e4viss\U00e4 olevat kielet Omat kielet -n\U00e4kym\U00e4st\U00e4.";
"wikitext-upload-captcha-error" = "Virhe CAPTCHA-varmennuksessa.";
"article-save-error-not-enough-space" = "Sinulla ei ole tarpeeksi tilaa laitteessasi artikkelin tallentamiseen";
"wikitext-upload-save-terms-and-licenses" = "Julkaisemalla hyv\U00e4ksyt %1$@k\U00e4ytt\U00f6ehdot%2$@ ja peruuttomattomasti muokkaustesi lisensoinnin %3$@CC BY-SA 3.0%4$@ -lisenssill\U00e4 sek\U00e4 %5$@GFDL%6$@-ehdot. Hyv\U00e4ksyt, ett\U00e4 linkki on riitt\U00e4v\U00e4 lisenssiehtojen esitt\U00e4mistapa.";
"explore-featured-article-sub-heading-from-wikipedia" = "Wikipediasta";
"insert-media-title" = "Lis\U00e4\U00e4 media";
"navbar-title-mode-edit-wikitext-preview" = "Esikatselu";
"aaald-characters-text-description" = "%1$d|0=merkki\U00e4|merkki|merkki\U00e4";
"page-history-graph-accessibility-label" = "Muokkausten aikakaavio";
"cancel" = "Peruuta";
"field-alert-password-confirm-mismatch" = "Salasanat eiv\U00e4t t\U00e4sm\U00e4\U00e4";
"on-this-day-footer" = "Lis\U00e4\U00e4 t\U00e4n\U00e4 p\U00e4iv\U00e4n\U00e4 tapahtuneita historiallisia tapahtumia";
"field-captcha-placeholder" = "Kuvavarmennuksen teksti";
"about-send-feedback" = "L\U00e4het\U00e4 palautetta sovelluksesta";
"field-alert-token-invalid" = "Koodi ei kelpaa";
"settings-help-and-feedback" = "Ohje ja palaute";
"editing-welcome-citations-title" = "Viittaa luotettaviin l\U00e4hteisiin";
"aaald-new-journal-reference-title" = "Lehtiartikkeli";
"talk-page-discussion-accessibility-hint" = "Kaksoisnapauta avataksesi keskusteluketjun";
"unable-to-load-talk-page-title" = "Keskustelusivun lataaminen ep\U00e4onnistui";
"welcome-notifications-tell-me-more-creation" = "Ilmoitukset luodaan ja l\U00e4hetet\U00e4\U00e4n laitteesta, eik\U00e4 Wikimedian tai muun osapuolen palvelimelta.";
"number-billions" = "%1$@ mrd.";
"reading-themes-controls-accessibility-text-size-slider" = "Tekstin koon liukus\U00e4\U00e4din";
"settings-support" = "Tue Wikipediaa";
"appearance-settings-reading-themes" = "Lukuteema";
"edit-link-remove-accessibility-label" = "Poista linkkisyntaksi";
"on-this-day-no-internet-error" = "Ei internetyhteytt\U00e4";
"account-creation-passwords-mismatched" = "Salasanat eiv\U00e4t t\U00e4sm\U00e4\U00e4.";
"settings-storage-and-syncing-enable-sync-title" = "Synkronoi tallennetut artikkelit ja luettelot";
"notifications-center-empty-not-subscribed" = "Et ole tilannut Wikipedia-ilmoituksia";
"reading-list-keep-subtitle" = "Artikkelit on synkronoitu Wikipedia-tunnukseesi. Haluaisitko s\U00e4ilytt\U00e4\U00e4 ne t\U00e4ss\U00e4 laitteessa uloskirjautumisen j\U00e4lkeen?";
"places-location-enabled" = "Sijanti k\U00e4yt\U00f6ss\U00e4";
"edit-menu-item-could-not-find-selection-alert-title" = "Valittua teksti\U00e4 ei l\U00f6ytynyt";
"main-menu-account-title-logged-in" = "Olet kirjautunut k\U00e4ytt\U00e4j\U00e4n\U00e4 %1$@";
"edit-text-style-accessibility-label" = "N\U00e4yt\U00e4 tekstintyylivalikko";
"notifications-center-go-to-title" = "Mene sivulle %1$@";
"description-edit-pencil-title" = "Muokkaa artikkelin kuvausta";
"edit-summary-placeholder-text" = "Miten paransit artikkelia?";
"main-menu-rate-app" = "Arvostele sovellus";
"explore-feed-preferences-show-continue-reading-title" = "N\U00e4yt\U00e4 \"Jatka lukemista\" -kortti";
"editing-welcome-be-bold-subtitle" = "Muokkaa rohkeasti, mutta \U00e4l\U00e4 holtittomasti. \U00c4l\U00e4 ep\U00e4r\U00f6i virheiden tekemist\U00e4, sill\U00e4 yhteis\U00f6mme voi tarvittaessa helposti palauttaa edellisen version.";
"talk-page-new-banner-subtitle" = "Olemme kaikki tavallisia ihmisi\U00e4";
"button-ok" = "OK";
"description-edit-length-warning" = "%1$@ / %2$@";
"explore-nearby-sub-heading-your-location" = "Sijaintisi";
"insert-media-image-position-setting-right" = "Oikea";
"button-save-for-later" = "Tallenna my\U00f6hemm\U00e4ksi";
"action-previous-revision-accessibility" = "Edellinen versio";
"replace-infolabel-method-replace-all" = "Korvaa kaikki";
"account-creation-missing-fields" = "Tunnuksen luomiseen vaaditaan k\U00e4ytt\U00e4j\U00e4nimi, salasana ja salasanan vahvistus.";
"settings-clear-cache-are-you-sure-title" = "Tyhjennet\U00e4\U00e4nk\U00f6 v\U00e4limuisti?";
"account-creation-captcha-title" = "CAPTCHA-kuvavarmennus";
"edit-ordered-list-accessibility-label" = "Tee valitusta rivist\U00e4 numeroitu lista";
"aaald-multiple-changes-description" = "Useita muutoksia tehty";
"explore-feed-preferences-global-cards-subtitle" = "Kielest\U00e4 riippumaton";
"edit-text-size-table-view-title" = "Tekstin koko";
"notifications-center-subheader-welcome" = "Tervetuloa!";
"explore-feed-preferences-feed-card-visibility-all-languages-off" = "Pois k\U00e4yt\U00f6st\U00e4";
"languages-settings-title" = "Kielet";
"reading-list-limit-hit-for-unsorted-articles-title" = "Lajittelemattomien artikkeleiden raja kohdattu";
"back-button-accessibility-label" = "Takaisin";
"in-the-news-notification-read-now-action-title" = "Lue nyt";
"notifications-center-subheader-edit-reverted" = "Muokkauksesi on kumottu";
"reading-list-limit-hit-for-unsorted-articles-subtitle" = "Lajittelemattomien artikkeleiden maksimim\U00e4\U00e4r\U00e4 on 5000. Lajittele olemassaolevat artikkelit listoihin jatkaaksesi lajittelemattomien artikkeleiden synkronointia.";
"panel-compare-revisions-title" = "Versioiden vertailu";
"page-history-user-edits" = "k\U00e4ytt\U00e4jilt\U00e4";
"explore-feed-preferences-explore-tab" = "Tutki-v\U00e4lilehti";
"explore-main-page-heading" = "T\U00e4n\U00e4\U00e4n Wikipediassa";
"reading-lists-large-sync-completed" = "%1$d|%1$d artikkeli|%1$d artikkelia ja %2$d|%2$d lukulista|%2$d lukulistaa synkronoitu tililt\U00e4si";
"explore-feed-preferences-feed-card-visibility-global-cards-on" = "K\U00e4yt\U00f6ss\U00e4";
"reading-list-unable-to-remove-entry" = "Odottamaton virhe tapahtui poistaessa merkint\U00e4\U00e4 lukulistasta. Yrit\U00e4 my\U00f6hemmin uudelleen.";
"reading-list-entry-limit-exceeded-message" = "Laske t\U00e4ll\U00e4 listalla olevien artikkelien m\U00e4\U00e4r\U00e4\U00e4 (maksimi %1$d) jatkaaksesi synkronointia kaikilla artikkeleilla.";
"share-building" = "Luodaan Share-a-fact korttia...";
"explore-feed-language-settings" = "Tutki-sy\U00f6tteen kieliasetukset";
"reading-themes-controls-accessibility-dark-theme-button" = "Tumma teema";
"reading-lists-article-added-confirmation" = "Artikkeli lis\U00e4tty listaan \U201c%1$@\U201d";
"aaald-revision-userInfo" = "K\U00e4ytt\U00e4j\U00e4n %1$@ muokkaus (%2$@ kpl)";
"reading-lists-article-queued-to-be-downloaded" = "Artikkeli lis\U00e4tty latausjonoon";
"appearance-settings-expand-tables-footer" = "Aseta kaikki taulukot (Pikafaktoja, Viitteet, Ilmoitukset ja Ulkoiset linkit) n\U00e4ytett\U00e4v\U00e4n oletuksena laajennettuna.";
"relative-date-minutes-ago-abbreviated" = "%1$d min sitten";
"notifications-center-filters-read-status-item-title-all" = "Kaikki";
"notifications-center-mark-as-unread" = "Merkitse lukemattomaksi";
"insert-media-uploaded-image-title" = "Tallennettu kuva";
"icon-shortcut-search-title" = "Etsi Wikipediasta";
"places-accessibility-show-more" = "N\U00e4yt\U00e4 lis\U00e4\U00e4 artikkeleja";
"in-the-news-notification-share-action-title" = "Jaa\U2026";
"account-talk-preferences-title" = "Keskustelusivujen asetukset";
"insert-media-image-type-setting-basic" = "Normaali";
"places-unknown-distance" = "tuntematon et\U00e4isyys";
"reading-lists-article-not-synced-list-limit-exceeded" = "Listaraja ylitetty, ei voi synkronoida artikkelia";
"settings-language-bar" = "N\U00e4yt\U00e4 kielet haussa";
"login-join-wikipedia" = "Liity Wikipediaan.";
"relative-date-months-ago" = "%1$d|0=T\U00e4ss\U00e4 kuussa|1=Viime kuussa|%1$d kuukautta sitten";
"two-factor-login-instructions" = "Sy\U00f6t\U00e4 kaksivaiheisen vahvistuksen koodi";
"edit-underline-accessibility-label" = "Lis\U00e4\U00e4 alleviivaus";
"no-internet-connection-article-reload" = "Uudempi versio t\U00e4st\U00e4 artikkelista saattaa olla saatavilla, mutta sit\U00e4 ei voida ladata ilman yhteytt\U00e4 Internetiin";
"article-languages-others" = "Muut kielet";
"description-edit-warning" = "Yrit\U00e4 pit\U00e4\U00e4 kuvaus lyhyen\U00e4, jotta k\U00e4ytt\U00e4j\U00e4t ymm\U00e4rt\U00e4isiv\U00e4t artikkelin aiheen yhdell\U00e4 silm\U00e4yksell\U00e4";
"aaald-two-sections-description" = "kappaleissa %1$@ ja %2$@";
"share-email-format" = "\U201c%1$@\U201d\n\nartikkelista \U201c%2$@\U201d\n\n%3$@";
"notifications-center-inbox-wikimedia-projects-section-title" = "Wikimedian projektit";
"aaald-deleted-text-description-2" = "%1$@ poistettu";
"add-articles-to-reading-list" = "Lis\U00e4\U00e4 %1$d|%1$d artikkeli|%1$d artikkelia lukulistaan";
"account-creation-have-account" = "Onko sinulla jo tunnus? %1$@";
"home-button-history-accessibility-label" = "Wikipedia, palaa Historia-sivulle";
"places-search-saved-articles" = "Kaikki tallennetut artikkelit";
"explore-feed-preferences-hide-card-action-title" = "Piilota t\U00e4m\U00e4 kortti";
"theme-light-display-name" = "Vaalea";
"welcome-intro-free-encyclopedia-more-about" = "Tietoja Wikipediasta";
"explore-feed-preferences-show-top-read-title" = "N\U00e4yt\U00e4 Luetuimmat-kortti";
"abuse-filter-disallow-unconstructive" = "Automaattinen suodatin on tunnistanut t\U00e4m\U00e4n muokkauksen mahdollisesti haitalliseksi tai vandalismin yritykseksi.";
"on-this-day-detail-header-title" = "%1$d|%1$d historiallinen tapahtuma|%1$d historiallista tapahtumaa";
"edit-link-remove-link-title" = "Poista linkki";
"explore-most-read-footer" = "Kaikki luetuimmat artikkelit";
"description-help-more-info-title" = "Lis\U00e4\U00e4 tietoa";
"places-accessibility-recenter-map-on-user-location" = "Keskit\U00e4 sijaintiisi";
"edit-strikethrough-accessibility-label" = "Lis\U00e4\U00e4 yliviivaus";
"about-testers-details" = "QA:n testannut %1$@";
"find-replace-header-close-accessibility" = "Sulje etsi ja korvaa";
"about-wikimedia-foundation" = "Wikimedia-s\U00e4\U00e4ti\U00f6";
"notifications-push-fallback-body-text" = "Uusi toiminta Wikipediassa";
"reading-list-new-list-description-placeholder" = "Valinnainen lyhyt kuvaus";
"two-factor-login-with-regular-code" = "K\U00e4yt\U00e4 vahvistuskoodia";
"aaald-many-sections-description" = "%1$d osiossa";
"button-skip" = "Ohita";
"notifications-center-subheader-thanks" = "Kiitos";
"table-of-contents-heading" = "Sis\U00e4llys";
"settings-storage-and-syncing-server-sync-title" = "P\U00e4ivit\U00e4 synkronoidut lukulistat";
"action-save" = "Tallenna";
"diff-thanks-login-title" = "Kirjaudu sis\U00e4\U00e4n l\U00e4hett\U00e4\U00e4ksesi kiitokset";
"settings-primary-language" = "Ensisijainen";
"talk-page-reply-title" = "Vastaa";
"diff-thanks-anonymous-no-thanks" = "Anonyymeille k\U00e4ytt\U00e4jille ei voi l\U00e4hett\U00e4\U00e4 kiitoksia";
"reading-lists-sync-error-no-internet-connection" = "Synkronointi jatkuu, kun internet-yhteys on k\U00e4ytett\U00e4viss\U00e4";
"edit-summary-learn-more-text" = "Lis\U00e4tietoja";
"abuse-filter-warning-subheading" = "Muokkauksesi saattaa sis\U00e4lt\U00e4\U00e4:";
"aaald-article-description-updated-description" = "Artikkelin kuvaus p\U00e4ivitetty";
"number-thousands" = "%1$@ t.";
"edit-direction-left-accessibility-label" = "Liikuta kursoria vasemmalle";
"aaald-one-section-description" = "%1$@ osiossa";
"main-menu-terms-of-use" = "K\U00e4ytt\U00f6ehdot";
"aaald-article-insert-read-more" = "Lue lis\U00e4\U00e4 p\U00e4ivityksi\U00e4";
"settings-clear-cache-cancel" = "Peruuta";
"description-help-tips-example-title-one" = "Leonardo da Vincin maalaus";
"home-reading-list-prompt" = "Tallennetut artikkelisi voidaan nyt j\U00e4rjest\U00e4\U00e4 lukulistoihin ja synkronoida laitteiden v\U00e4lill\U00e4. Ota lukulistojen tallentumisen k\U00e4ytt\U00f6\U00f6n k\U00e4ytt\U00e4j\U00e4asetuksissa kirjautumalla sis\U00e4\U00e4n.";
"replace-method-button-accessibility" = "Korvausmenetelm\U00e4, %1$@ valittu. Vaihda napauttamalla.";
"description-published-footer" = "Artikkeleita voi muokata my\U00f6s t\U00e4ss\U00e4 sovelluksessa. Kokeile vaikkapa kirjoitusvirheiden korjaamista napauttamalla kyn\U00e4n kuvaketta.";
"sort-by-title-action" = "Otsikko";
"compass-direction" = "klo %1$@";
"appearance-settings-expand-tables" = "Laajenna taulukot";
"insert-media-image-type-settings-title" = "Kuvan tyyppi";
"article-languages-yours" = "Omat kielet";
"reading-list-new-list-name-placeholder" = "Lukulistan nimi";
"reading-list-keep-title" = "S\U00e4ilytet\U00e4\U00e4nk\U00f6 tallennetut artikkelit laitteessa?";
"explore-random-article-heading" = "Satunnainen artikkeli";
"edit-subscript-accessibility-label" = "Lis\U00e4\U00e4 alaindeksin muotoilu";
"notifications-center-title" = "Ilmoitukset";
"explore-feed-preferences-customize-explore-feed-action-title" = "Mukauta Tutki-sy\U00f6tett\U00e4";
"on-this-day-footer-showing-event-count" = "%1$d|%1$d historiallinen tapahtuma|%1$d historiallista tapahtumaa lis\U00e4\U00e4 t\U00e4n\U00e4 p\U00e4iv\U00e4n\U00e4";
"settings-storage-and-syncing-title" = "Artikkelien tallennus ja synkronointi";
"talk-page-new-body-textfield-accessibility-label" = "Keskustelurunko";
"diff-paragraph-moved-distance-line" = "%1$d|%1$d rivi|%1$d rivi\U00e4";
"action-unsaved-accessibility-notification" = "Artikkeli tallentamatta";
"reading-lists-default-list-title" = "Tallennetut";
"about-testers" = "Testaajat";
"notifications-center-empty-state-num-filters" = "%1$d|%1$d suodatin|%1$d suodatinta";
"appearance-settings-text-sizing-example-text" = "Muuta artikkelin tekstin kokoa vet\U00e4m\U00e4ll\U00e4 liukus\U00e4\U00e4dint\U00e4. Sovelluksen k\U00e4ytt\U00f6liittym\U00e4n tekstin kokoa muutetaan k\U00e4ytt\U00f6j\U00e4rjestelm\U00e4n asetuksista.";
"aaald-new-talk-topic-description-format" = "%1$@ t\U00e4st\U00e4 artikkelista";
"new-password-title" = "Aseta salasanasi";
"explore-because-you-read-footer" = "Muut liittyv\U00e4t artikkelit";
"reading-themes-controls-accessibility-syntax-highlighting-switch" = "Syntaksin korostus";
"explore-feed-preferences-turn-on-explore-feed-alert-message" = "Valitsemalla Tutki-sy\U00f6tteen kortteja otat Tutki-n\U00e4kym\U00e4n k\U00e4ytt\U00f6\U00f6n";
"notifications-center-inbox-title" = "Projektit";
"action-redo" = "Tee uudelleen";
"main-menu-zero-faq" = "Usein kysyttyj\U00e4 kysymyksi\U00e4 Wikipedia Zerosta";
"diff-single-intro-title" = "Intro";
"edit-published-subtitle" = "Teit juuri Wikipediasta paremman kaikille";
"move-articles-to-reading-list" = "Siirr\U00e4 %1$d|%1$d artikkeli|%1$d artikkelia lukulistaan";
"explore-feed-preferences-related-pages-description" = "Lukuhistoriaan perustuvat ehdotukset";
"replace-textfield-placeholder" = "Korvaa seuraavalla...";
"about-places-maps-license" = "Paikat-kartan lisenssi";
"edit-template-remove-accessibility-label" = "Poista mallinesyntaksi";
"explore-most-read-sub-heading-on-wikipedia" = "Wikipediassa";
"action-replace-all" = "Korvaa kaikki";
"aaald-view-full-history-button" = "N\U00e4yt\U00e4 koko artikkelihistoria";
"intermediate-edits-editors-limited-count" = "%1$d|Yht\U00e4 v\U00e4liss\U00e4 olevaa versiota|%1$d v\U00e4liss\U00e4 olevaa versiota %2$d+ k\U00e4ytt\U00e4j\U00e4n tekemin\U00e4 ei n\U00e4ytet\U00e4";
"edit-increase-indent-depth-accessibility-label" = "Lis\U00e4\U00e4 sisennyksen syvyytt\U00e4";
"feed-news-notification-text" = "Kytke ilmoitukset p\U00e4\U00e4lle saadaksesi ilmoituksen artikkeleista jotka ovat nousussa uutisissa.";
"reading-list-exists-with-same-name" = "Lukulistan nimi on jo k\U00e4yt\U00f6ss\U00e4";
"diff-thanks-sent-cannot-unsend" = "Kiitoksen l\U00e4hett\U00e4mist\U00e4 ei voi kumota";
"account-talk-page-title" = "Oma keskustelusivu";
"main-menu-account-logout-cancel" = "Peruuta";
"aaald-new-news-reference-retrieved-date" = "Viitattu %1$@.";
"reading-list-add-saved-title" = "L\U00f6ydetyt tallennetut artikkelit";
"welcome-exploration-explore-feed-description" = "Suositellut luettavat ja p\U00e4vitt\U00e4iset artikkelit yhteis\U00f6st\U00e4mme";
"preference-title-eventlogging-opt-in" = "L\U00e4het\U00e4 k\U00e4ytt\U00f6raportteja";
"description-help-tips-description" = "Kuvauksen tulisi mahtua yhdelle riville eli olla 2-12 sanan pituinen.";
"notifications-center-subheader-page-link" = "Sivulinkki";
"welcome-intro-free-encyclopedia-description" = "Wikipedia on kirjoitettu yhteisty\U00f6ss\U00e4 vapaaehtoisten kanssa ja se koostuu yli 40 miljoonasta artikkelista yli 300 kielell\U00e4.";
"welcome-languages-add-button" = "Lis\U00e4\U00e4 uusi kieli";
"welcome-notifications-tell-me-more-storage" = "Ilmoitusasetukset tallennetaan laitteeseen, eiv\U00e4tk\U00e4 ne pohjaudu henkil\U00f6kohtaisiin tietoihin tai toimintaan.";
"account-talk-preferences-auto-sign-discussions-setting-explanation" = "Allekirjoita keskusteluviestit asetuksissa m\U00e4\U00e4ritellyll\U00e4 allekirjoituksella automaattisesti";
"explore-most-read-sub-heading-on-language-wikipedia" = "Wikipedian kieliversiossa %1$@";
"settings-appearance" = "Lukuasetukset";
"share-open-in-maps" = "Avaa Kartoissa";
"description-welcome-start-editing-button" = "Aloita muokkaaminen";
"more-languages-tooltip-title" = "Lis\U00e4\U00e4 kieli\U00e4";
"page-history-revision-comment-accessibility-label" = "Kommentti %1$@";
"featured-widget-from-wikipedia" = "Wikipediasta";
"replace-infolabel-method-replace" = "Korvaa";
"search-clear-title" = "Tyhjenn\U00e4";
"login-forgot-password" = "Unohditko salasanasi?";
"edit-bold-remove-accessibility-label" = "Poista lihavoitu muotoilu";
"places-filter-top-articles" = "Luetuimmat";
"field-email-title" = "S\U00e4hk\U00f6posti";
"edit-signature-accessibility-label" = "Lis\U00e4\U00e4 allekirjoituksen syntaksi";
"login-no-account" = "Eik\U00f6 sinulla viel\U00e4 ole k\U00e4ytt\U00e4j\U00e4tunnusta? %1$@";
"intermediate-edits-editors-count-limited" = "%1$d+ v\U00e4liss\U00e4 olevaa versiota %2$d+ k\U00e4ytt\U00e4j\U00e4n tekemin\U00e4 ei n\U00e4ytet\U00e4";
"edit-ordered-list-remove-accessibility-label" = "Poista valittu rivi numeroidusta listasta";
"aaald-new-book-reference-title" = "Kirja";
"find-textfield-accessibility" = "Etsi";
"in-the-news-title" = "Uutisissa";
"home-themes-prompt" = "Mukauta lukukokemusta sinulle sopivaksi muuttamalla tekstin kokoa ja teemaa artikkelipalkista tai sovelluksen asetuksista.";
"reading-list-api-error-entry-limit" = "T\U00e4t\U00e4 merkint\U00e4\U00e4 ei ole synkronoitu koska olet saavuttanut merkint\U00f6jen lukum\U00e4\U00e4r\U00e4n rajan t\U00e4ss\U00e4 listassa.";
"action-read" = "Lue";
"welcome-languages-add-or-edit-button" = "Lis\U00e4\U00e4 tai muokkaa ensisijaisia kieli\U00e4";
"notifications-center-mark-all-as-read" = "Merkitse kaikki luetuksi";
"settings-storage-and-syncing-enable-sync-footer-text" = "Salli Wikimedian tallentaa tallennetut artikkelisi ja lukulistasi k\U00e4ytt\U00e4j\U00e4asetuksiisi.";
"notifications-center-go-to-user-page" = "Mene k\U00e4ytt\U00e4j\U00e4n %1$@ k\U00e4ytt\U00e4j\U00e4sivulle";
"talk-page-discussion-read-accessibility-label" = "Lue";
"editing-welcome-citations-subtitle" = "Kaikki sis\U00e4lt\U00f6 on oltava vahvistettavissa. Artikkeliin kirjoitettaville v\U00e4itteille tulisi lis\U00e4t\U00e4 lis\U00e4t\U00e4 luotettava l\U00e4hde, jossa v\U00e4itteen sis\U00e4lt\U00f6 todetaan.";
"reading-list-add-saved-button-title" = "Kyll\U00e4, lis\U00e4\U00e4 ne lukulistoihini";
"talk-page-error-unable-to-post-topic" = "Ei Internet-yhteytt\U00e4. Keskustelua ei voi l\U00e4hett\U00e4\U00e4.";
"main-menu-nearby" = "L\U00e4hist\U00f6ll\U00e4";
"edit-comment-remove-accessibility-label" = "Poista kommenttisyntaksi";
"theme-black-display-name" = "Musta";
"forgot-password-email-sent" = "S\U00e4hk\U00f6posti salasanan palautusohjeiden kanssa l\U00e4hetetty.";
"home-nearby-location-footer" = "L\U00e4hist\U00f6ll\U00e4: %1$@";
"explore-feed-preferences-show-on-this-day-footer-text" = "T\U00e4n\U00e4 p\U00e4iv\U00e4n\U00e4 -kortin poistaminen k\U00e4yt\U00f6st\U00e4 poistaa sen k\U00e4yt\U00f6st\U00e4 kaikilla kielill\U00e4.";
"description-published-subtitle" = "Teit juuri Wikipediasta paremman kaikille";
"announcements-dismiss" = "Sulje";
"share-article-name-on-wikipedia" = "\"%1$@\" @Wikipedia'ssa:";
"edit-link-link-target-title" = "Linkin kohde";
"explore-feed-preferences-feed-card-visibility-languages-count" = "%1$d kielell\U00e4";
"places-search-suggested-searches-header" = "Ehdotetut haut";
"login-title" = "Kirjaudu sis\U00e4\U00e4n tunnuksellesi";
"empty-no-saved-pages-in-reading-list-message" = "Tallenna sivuja t\U00e4h\U00e4n listaan n\U00e4hd\U00e4ksesi ne t\U00e4\U00e4ll\U00e4";
"more-languages-tooltip-description" = "Hae Wikipediasta yli 300 kielell\U00e4";
"top-read-widget-title" = "Luetuimmat";
"reading-list-login-button-title" = "Kirjaudu sis\U00e4\U00e4n synkronoidaksesi tallennetut artikkelisi";
"history-clear-cancel" = "Peruuta";
"page-history-revision-minor-edit-accessibility-label" = "Pieni muutos";
"action-saved" = "Tallennettu";
"about-wikipedia" = "Wikipedia";
"relative-date-seconds-abbreviated" = "%1$d sek";
"theme-sepia-display-name" = "Seepia";
"action-move-to-reading-list" = "Siirr\U00e4 lukulistaan";
"explore-feed-preferences-global-cards-title" = "Globaalit kortit";
"explore-most-read-generic-heading" = "Luetuimmat";
"forgot-password-button-title" = "Palauta";
"description-edit-learn-more" = "Lis\U00e4tietoja";
"edit-summary-choice-fixed-typos" = "Korjattu kirjoitusvirhe";
"reading-list-entry-limit-exceeded-title" = "Olet ylitt\U00e4nyt tunnuskohtaisen rajoituksen, joka on %1$d|%1$d artikkeli|%1$d artikkelia tunnusta kohden.";
"notifications-center-subheader-page-reviewed" = "Sivu arvioitu";
"reading-list-create-new-list-button-title" = "Luo lukulista";
"description-help-tips-example-description-two" = "Mount Everesti\U00e4 k\U00e4sittelev\U00e4n artikkelin kuvaus";
"home-button-saved-accessibility-label" = "Wikipedia, palaa Tallennettu-sivulle";
"reading-list-generic-error" = "Odottamaton virhe tapahtui lukulistaasi p\U00e4ivitt\U00e4ess\U00e4.";
"app-store-keywords" = "Wikipedia, viittaus, wiki, tietosanakirja, tieto, info, tutkimus, tutki, opi";
"article-reference-view-title" = "L\U00e4hde %1$@";
"main-menu-title" = "Lis\U00e4\U00e4";
"relative-date-years-ago" = "%1$d|0=T\U00e4n\U00e4 vuonna|1=Viime vuonna|%1$d vuotta sitten";
"table-of-contents-hide-button-label" = "Piilota sis\U00e4llysluettelo";
"reading-list-list-limit-reached" = "Olet ylitt\U00e4nyt %1$d listan tunnuskohtaisen rajoituksen";
"insert-media-alternative-text-placeholder" = "Kuvaile t\U00e4t\U00e4 kuvaa";
"notifications-center-status-in-projects-plain" = "%1$d|1=1 projekti|%1$d projektia";
"aaald-multiple-references-added-description" = "Useita viitteit\U00e4 lis\U00e4tty";
"edit-italic-accessibility-label" = "Lis\U00e4\U00e4 kursivoitu muotoilu";
"abuse-filter-warning-caps" = "Kaikki teksti tikkukirjaimilla";
"button-publish" = "Julkaise";
"reading-list-sync-disabled-panel-title" = "Sykronointi poistettu k\U00e4yt\U00f6st\U00e4";
"saved-pages-image-download-error" = "T\U00e4m\U00e4n tallennetun sivun kuvien lataaminen ep\U00e4onnistui.";
"share-get-directions-in-maps" = "Hae reittiohjeet";
"aaald-numerical-multiple-references-added-description" = "%1$d|0=0 viitett\U00e4|%1$d viite|%1$d viitett\U00e4 added";
"editing-welcome-impartial-tone-subtitle" = "Artikkelin s\U00e4vyn on oltava neutraali. Pyri kirjoittamaan tasapuolisesti luotettavien l\U00e4hteiden kuvailuja mukaillen.";
"about-repositories" = "Tietovarastot";
"notifications-center-filters-title" = "Suodattimet";
"explore-feed-preferences-turn-on-explore-tab-action-title" = "Ota Tutki-v\U00e4lilehti k\U00e4ytt\U00f6\U00f6n";
"edit-direction-up-accessibility-label" = "Liikuta kursoria yl\U00f6s";
"readers-accessibility-label" = "%1$@ lukijaa";
"wikitext-preview-link-external-preview-title" = "Ulkoinen linkki";
"panel-compare-revisions-text" = "Muutosten vertailulla on helppo saada kuva artikkeliin tehdyist\U00e4 muutoksista. Toiminto korostaa artikkelista kohdat, joihin on tehty muutoksia.";
"diff-compare-header-from-info-heading" = "Alkuper\U00e4inen:";
"notifications-center-subheader-wikidata-connection" = "Wikidata-yhteys muodostettu";
"settings-storage-and-syncing-erase-saved-articles-alert-message" = "Tallennettujen artikkeleiden tyhjent\U00e4minen poistaa ne k\U00e4ytt\U00e4j\U00e4tunnukseltasi, jos sinulla on synkronointi k\U00e4yt\U00f6ss\U00e4 t\U00e4ll\U00e4 laitteella. T\U00e4t\U00e4 toimintoa ei voi kumota.";
"page-location" = "Tarkastele kartalla";
"error-unknown" = "Tapahtui tuntematon virhe";
"reading-list-api-error-list-limit" = "T\U00e4t\U00e4 luetteloa ei synkronoida, koska olet saavuttanut synkronoitujen listojen lukum\U00e4\U00e4r\U00e4n rajan.";
"reading-lists-split-notification" = "On olemassa %1$d artikkelin raja lukulistaa kohden. Nykyiset t\U00e4m\U00e4n rajan ylitt\U00e4v\U00e4t listat on jaettu moniin listoihin.";
"action-add-to-reading-list" = "Lis\U00e4\U00e4 lukulistaan";
"places-filter-articles-action-sheet-title" = "Suodata artikkeleita";
"notifications-center-subheader-mention-edit-summary" = "Maininta muokkausyhteenvedossa";
"aaald-single-reference-added-description" = "Viite lis\U00e4tty";
"insert-media-image-size-settings-px-unit-name" = "px";
"reading-list-keep-sync-disabled-remove-article-button-title" = "Ei, poista artikkelit laitteesta ja Wikipedia-tunnukseltani";
"settings-search-open-app-on-search" = "Avaa sovellus Haku-n\U00e4kym\U00e4\U00e4n";
"aaald-error-title" = "Artikkelihistorian lataaminen ep\U00e4onnistui";
"insert-media-caption-caption-placeholder" = "Kuinka t\U00e4m\U00e4 kuva liittyy artikkeliin?";
"diff-thanks-sent" = "Kiitoksesi l\U00e4hetettiin k\U00e4ytt\U00e4j\U00e4lle %1$@";
"empty-no-saved-pages-message" = "Tallenna sivuja tarkastellaksesi niit\U00e4 my\U00f6hemmin, jopa yhteydett\U00f6m\U00e4ss\U00e4 tilassa";
"insert-media-image-size-setting-default" = "Oletus";
"about-places-maps-license-details" = "Paikat k\U00e4ytt\U00e4\U00e4 Apple Kartat -palvelun tarjoamia karttoja. %1$@.";
"page-history-revision-history-title" = "Muutoshistoria";
"empty-no-article-message" = "Pahoittelut, artikkelia ei voitu ladata";
"on-this-day-title" = "T\U00e4n\U00e4 p\U00e4iv\U00e4n\U00e4";
"places-search-recently-searched-header" = "\U00c4skett\U00e4in haetut";
"notifications-center-subheader-login-fail-known-device" = "Useita ep\U00e4onnistuneita kirjautumisyrityksi\U00e4";
"explore-potd-sub-heading" = "Wikimedia Commonsista";
"places-accessibility-show-as-map" = "N\U00e4yt\U00e4 karttana";
"explore-feed-preferences-places-description" = "Wikipedia-artikkelit l\U00e4hell\U00e4 sijaintiasi";
"home-title-accessibility-label" = "Wikipedia, selaa Tutki-sy\U00f6tteen alkuun";
"talk-page-link-user-action-sheet-app" = "N\U00e4yt\U00e4 k\U00e4ytt\U00e4j\U00e4n keskustelusivu sovelluksessa";
"featured-widget-content-failure-for-date" = "Suositeltu artikkeli ei ole saatavilla t\U00e4lle p\U00e4iv\U00e4lle.";
"widget-onthisday-placeholder-article-snippet" = "Vapaa tietosanakirja, jota kuka tahansa voi muokata";
"add-citation-title" = "Lis\U00e4\U00e4 viittaus";
"in-the-news-sub-title-from-wikipedia" = "Wikipediasta";
"nearby-distance-label-km" = "%1$@ km";
"description-help-tips-example-title-two" = "Maapallon korkein vuori";
"edit-subscript-remove-accessibility-label" = "Poista alaindeksin muotoilu";
"places-enable-location-description" = "K\U00e4ytt\U00f6mahdollisuus sijaintiisi on k\U00e4ytett\U00e4viss\U00e4 vain, kun sovellus tai jokin sen ominaisuuksista on n\U00e4kyviss\U00e4 n\U00e4yt\U00f6ll\U00e4si.";
"explore-feed-preferences-customize-explore-feed" = "Mukauta Tutki-sy\U00f6tett\U00e4";
"explore-feed-preferences-show-related-pages-title" = "N\U00e4yt\U00e4 Koska luit -kortti";
"notifications-push-talk-messages-format" = "%1$d|uusi viesti|uutta viesti\U00e4";
"on-this-day-sub-title-for-date-from-language-wikipedia" = "%1$@ kieliversion %2$@ Wikipediassa";
"intermediate-edits-count" = "%1$d|Yht\U00e4 v\U00e4liss\U00e4 olevaa versiota|%1$d v\U00e4liss\U00e4 olevaa versiota ei n\U00e4ytet\U00e4";
"relative-date-days-ago" = "%1$d|0=T\U00e4n\U00e4\U00e4n|1=Eilen|%1$d p\U00e4iv\U00e4\U00e4 sitten";
"notifications-center-subheader-login-success-unknown-device" = "Kirjautuminen tuntemattomalta laitteelta";
"edit-published" = "Muokkaus julkaistu";
"status-saving-for-later" = "Tallennetaan my\U00f6hemp\U00e4\U00e4 varten...";
"welcome-languages-description" = "Olemme l\U00f6yt\U00e4neet seuraavat kielet laitteestasi:";
"reverted-edit-thanks-for-editing-title" = "Kiitos Wikipedian muokkaamisesta!";
"talk-page-link-user-action-sheet-safari" = "N\U00e4yt\U00e4 k\U00e4ytt\U00e4j\U00e4sivu Safarissa";
"notifications-center-go-to-wikidata-item" = "Mene Wikidata-kohteeseen";
"aaald-vandalism-revert-description" = "Ep\U00e4ilty vandalismi kumottu";
"talk-page-new-topic-success-text" = "Keskustelusi julkaistiin onnistuneesti";
"aaald-summary-title" = "%1$d|0=0 muutosta|%1$d muutos|%1$d muutosta %2$d|0=0 k\U00e4ytt\U00e4j\U00e4lt\U00e4|%2$d k\U00e4ytt\U00e4j\U00e4lt\U00e4|%2$d k\U00e4ytt\U00e4j\U00e4lt\U00e4 %3$d|0=0 p\U00e4iv\U00e4ss\U00e4|%3$d p\U00e4iv\U00e4ss\U00e4|%3$d p\U00e4iv\U00e4ss\U00e4";
"notifications-center-status-all" = "Kaikki";
"field-backup-token-title" = "Varmuuskopiointikoodi";
"talk-page-discussion-unread-accessibility-label" = "Lukematon";
"wikitext-preview-link-not-found-preview-title" = "Sis\U00e4ist\U00e4 linkki\U00e4 ei l\U00f6ydy";
"reading-list-api-error-generic" = "Odottamaton virhe tapahtui lukulistaasi synkronoidessa.";
"reading-themes-controls-accessibility-light-theme-button" = "Vaalea teema";
"account-group-title" = "Oma k\U00e4ytt\U00e4j\U00e4tunnus";
"relative-date-min-ago" = "$|0=Juuri nyt|%1$d minuutti sitten|%1$d minuuttia sitten";
"settings-languages-feed-customization" = "Valitse Tutki-sy\U00f6tteen sis\U00e4lt\U00f6jen n\U00e4ytett\U00e4v\U00e4t kielet.";
"wikitext-upload-captcha-needed" = "CAPTCHA-varmennus vaaditaan.";
"account-creation-captcha-request-account" = "Pyyd\U00e4 k\U00e4ytt\U00e4j\U00e4tunnusta.";
"explore-nearby-placeholder-sub-heading-on-language-wikipedia" = "Wikipedian kieliversiosta %1$@";
"search-recent-clear-delete-all" = "Poista kaikki";
"button-saved-for-later" = "Tallennettu my\U00f6hemm\U00e4ksi";
"wikitext-downloading" = "Ladataan sis\U00e4lt\U00f6\U00e4...";
"places-search-top-articles-that-match-scope" = "L\U00e4hist\U00f6ll\U00e4";
"search-result-redirected-from" = "Ohjattu sivulta: %1$@";
"about-libraries-license" = "Lisenssi";
"wikitext-preview-link-preview-title" = "Linkin esikatselu";
"edit-decrease-indent-depth-accessibility-label" = "V\U00e4henn\U00e4 sisennyksen syvyytt\U00e4";
"home-nearby-footer" = "Lis\U00e4\U00e4 l\U00e4hell\U00e4si olevia paikkoja";
"editing-welcome-be-bold-title" = "\U00c4\U00e4nesi on t\U00e4rke\U00e4";
"page-history-revision-time-accessibility-label" = "Versio tehtiin %1$@";
"notifications-center-header-alert-from-project" = "Ilmoitus projektista %1$@";
"places-search-default-text" = "Hae paikkoja";
"empty-diff-single-title" = "N\U00e4kyvi\U00e4 muutoksia ei tehty";
"reading-list-login-title" = "Synkronoi tallennetut artikkelisi?";
"aaald-article-insert-header" = "Merkitt\U00e4v\U00e4t p\U00e4ivitykset";
"history-title" = "Historia";
"description-help-tips-for-example" = "Esimerkkej\U00e4:";
"description-help-tips-example-description-one" = "Mona Lisaa k\U00e4sittelev\U00e4n artikkelin kuvaus";
"explore-feed-preferences-in-the-news-description" = "Artikkelit ajankohtaisista tapahtumista";
"main-menu-heading-legal" = "Tietosuoja ja Ehdot";
"welcome-exploration-places-title" = "Paikat-v\U00e4lilehti";
"welcome-exploration-on-this-day-title" = "T\U00e4n\U00e4 p\U00e4iv\U00e4n\U00e4";
"empty-no-history-title" = "Ei n\U00e4ytett\U00e4v\U00e4\U00e4 historiaa";
"empty-no-saved-pages-title" = "Ei tallennettuja sivua viel\U00e4";
"notifications-center-filters-read-status-item-title-read" = "Luettu";
"reading-lists-sort-saved-articles" = "Lajitteluperuste";
"number-millions" = "%1$@ milj.";
"talk-page-new-subject-textfield-accessibility-label" = "Aihe";
"talk-page-title-user-talk" = "Keskustelu k\U00e4ytt\U00e4j\U00e4st\U00e4";
"places-accessibility-clear-saved-searches" = "Tyhjenn\U00e4 tallennetut haut";
"history-clear-delete-all" = "Kyll\U00e4, poista kaikki";
"home-news-footer" = "Lis\U00e4\U00e4 ajankohtaisia tapahtumia";
"top-read-header-generic" = "Wikipedia";
"back-button-popover-title" = "Napauta palataksesi";
"diff-paragraph-moved-direction-down" = "alas";
"places-accessibility-group" = "%1$@ artikkelia";
"nearby-distance-label-meters" = "%1$@ metri\U00e4";
"article-languages-label" = "Valitse kieli";
"rank-accessibility-label" = "Numero %1$@";
"aaald-new-website-reference-title" = "Verkkosivu";
"places-search-your-current-location" = "Nykyinen sijaintisi";
"page-protected-other" = "Sivun suojaustaso on: %1$@";
"insert-media-image-position-setting-center" = "Keski";
"diff-revision-error-title" = "Versiohistorian n\U00e4ytt\U00e4minen ep\U00e4onnistui";
"no-internet-connection" = "Ei Internet-yhteytt\U00e4";
"welcome-notifications-tell-me-more-title" = "Lis\U00e4tietoja ilmoituksista";
"featured-widget-language-failure" = "Ensisijainen Wikipedia-kielesi ei tue Suositeltua artikkelia. Voit p\U00e4ivitt\U00e4\U00e4 Wikipedian asetuksia sovelluksen asetuksista.";
"abuse-filter-warning-irrelevant" = "Aiheeseen liittym\U00e4tt\U00f6mi\U00e4 ulkoisia linkkej\U00e4 tai kuvia";
"abuse-filter-disallow-heading" = "Et voi julkaista t\U00e4t\U00e4 muokkausta.";
"potd-widget-title" = "P\U00e4iv\U00e4n kuva";
"reading-list-entry-limit-reached" = "%1$d|Artikkelia|Artikkeleita ei voitu lis\U00e4t\U00e4 listaan. Olet kohdannut %2$d artikkelin rajan listassa \"%3$@\"";
"reading-lists-count" = "%1$d|%1$d lukulista|%1$d lukulistaa";
"welcome-exploration-explore-feed-title" = "Tutki sy\U00f6tett\U00e4";
"edit-bold-accessibility-label" = "Lis\U00e4\U00e4 lihavoitu muotoilu";
"main-menu-account-login" = "Kirjaudu sis\U00e4\U00e4n";
"empty-no-feed-message" = "N\U00e4et suositellut artikkelisi kun sinulla on Internet-yhteys";
"description-edit-title" = "Muokkaa kuvausta";
"notifications-center-change-password" = "Vaihda salasana";
"talk-pages-reply-button-title" = "Vastaa t\U00e4h\U00e4n keskusteluun";
"reading-list-name-user-created-annotation" = "_[k\U00e4ytt\U00e4j\U00e4 luotu]";
"table-of-contents-button-label" = "Sis\U00e4llysluettelo";
"explore-feed-preferences-show-featured-article-title" = "N\U00e4yt\U00e4 Suositeltu artikkeli -kortti";
"top-read-see-more" = "Katso lis\U00e4\U00e4 luetuimpia";
"wikitext-upload-result-unknown" = "wikitextin l\U00e4hetyst\U00e4 ei voida varmistaa.";
"wikitext-upload-save-anonymously-warning" = "Muokkaukset yhdistet\U00e4\U00e4n laitteesi IP-osoitteeseen. Jos %1$@ tietoturvasi paranee.";
"about-product-of" = "%1$@ yhdess\U00e4 sinun kaltaistesi vapaaehtoisten avustamana";
"diff-thanks-sent-already" = "Olet jo l\U00e4hett\U00e4nyt kiitokset t\U00e4lle muokkaukselle";
"places-filter-saved-articles" = "Tallennetut artikkelit";
"account-talk-preferences-auto-sign-discussions" = "Allekirjoita automaattisesti";
"field-new-password-title" = "Uusi salasana";
"talk-page-publish-terms-and-licenses" = "Tallentamalla hyv\U00e4ksyt %1$@K\U00e4ytt\U00f6ehdot%2$@ sek\U00e4 kirjoituksen julkaisemisen %3$@CC BY-SA 3.0%4$@ ja %5$@GFDL%6$@ -lisensseill\U00e4.";
"welcome-exploration-places-description" = "L\U00f6yd\U00e4 maamerkkej\U00e4 l\U00e4hell\U00e4 sivua tai etsi paikkoja ymp\U00e4ri maailmaa";
"action-move-to" = "Siirr\U00e4 kohteeseen...";
"action-saved-accessibility-notification" = "Artikkeli tallennettu my\U00f6hemm\U00e4ksi";
"welcome-send-data-sub-title" = "Auta sovelluksen kehitysty\U00f6ss\U00e4 antamalla Wikimedia-s\U00e4\U00e4ti\U00f6n ker\U00e4t\U00e4 tietoja sovelluksen k\U00e4ytt\U00f6tavoista. Tiedot ker\U00e4t\U00e4\U00e4n anonyymisti.";
"reading-lists-article-api-failure" = "Artikkelin synkronointi ei onnistu";
"saved-pages-progress-syncing" = "Artikkelin lataus k\U00e4ynniss\U00e4...";
"logged-out-title" = "Olet kirjautunut ulos";
"article-about-title" = "Tietoa t\U00e4st\U00e4 artikkelista";
"settings-notifications" = "Ilmoitukset";
"home-button-explore-accessibility-label" = "Wikipedia, palaa Tutki-sivulle";
"insert-media-image-size-settings-title" = "Kuvan koko";
"aaald-new-journal-reference-volume" = "Vuosikerta %1$@:";
"relative-date-seconds-ago-abbreviated" = "%1$d sek sitten";
"data-migration-status" = "P\U00e4ivitet\U00e4\U00e4\U00e4n...";
"talk-page-error-unable-to-post-reply" = "Ei Internet-yhteytt\U00e4. Vastausta ei voi l\U00e4hett\U00e4\U00e4.";
"languages-title" = "Kielenvaihto";
"notifications-center-login-notifications" = "Kirjautumisilmoitukset";
"relative-date-minutes-abbreviated" = "%1$d min";
"settings-my-languages" = "Omat kielet";
"logged-out-subtitle" = "Tunnistauduttaessa tapahtui virhe. Kirjaudu takaisin sis\U00e4\U00e4n synkronoidaksesi lukulistasi sek\U00e4 muokataksesi k\U00e4ytt\U00e4j\U00e4tunnuksellasi.";
"explore-feed-preferences-show-randomizer-footer-text" = "Satunnaistaminen-kortin poistaminen k\U00e4yt\U00f6st\U00e4 poistaa sen k\U00e4yt\U00f6st\U00e4 kaikilla kielill\U00e4.";
"field-alert-captcha-invalid" = "Virheellinen kuvavarmennuksen vastaus";
"menu-cancel-accessibility-label" = "Peru";
"find-next-button-accessibility" = "Seuraava hakutulos";
"explore-nearby-placeholder-heading" = "Paikat";
"abuse-filter-warning-repeat" = "Toistuvia merkkej\U00e4";
"editing-welcome-impartial-tone-title" = "Kirjoita puolueettomaan s\U00e4vyyn";
"insert-media-alternative-text-title" = "Vaihtoehtoinen teksti";
"diff-context-lines-expanded-button-title" = "Piilota";
"main-menu-account-logout-are-you-sure" = "Haluatko varmasti kirjautua ulos?";
"settings-primary-language-details" = "Listan ensimm\U00e4inen kieli on sovelluksen k\U00e4ytt\U00f6liittym\U00e4n kieli.";
"about-libraries-complete-list" = "T\U00e4ydellinen luettelo";
"notifications-center-subheader-mention-successful" = "Onnistunut maininta";
"diff-unedited-lines-format" = "%1$d|%1$d rivi ilman muutoksia|%1$d rivi\U00e4 ilman muutoksia";
"main-menu-account-logout" = "Kirjaudu ulos";
"places-search-this-area" = "Hae t\U00e4ll\U00e4 alueelta";
"empty-no-other-article-languages-title" = "Muita kieli\U00e4 ei saatavilla";
"field-token-title" = "Vahvistuskoodi";
"description-edit-placeholder-title" = "Lyhyet kuvaukset ovat parhaita";
"replace-buttons-replace-all-accessibility" = "Korvaa kaikki instanssit";
"explore-feed-preferences-feed-cards-hidden-title" = "Kaikki %1$@ korttia piilotettu";
"theme-default-explanation" = "J\U00e4rjestelm\U00e4asetuksien mukainen";
"notifications-center-status-in-types" = "%1$d|1=1 tyyppi|%1$d tyyppi\U00e4";
"notifications-center-swipe-more" = "Lis\U00e4\U00e4";
"settings-account" = "K\U00e4ytt\U00e4j\U00e4tunnus";
"field-password-title" = "Salasana";
"reading-themes-controls-accessibility-black-theme-button" = "Musta teema";
"description-edit-for-article" = "Artikkelin kuvaus %1$@";
"search-reading-list-placeholder-text" = "Hae lukulistasta";
"editing-welcome-set-knowledge-free-subtitle" = "Tarvitsemme sinua lukemaan, kirjoittamaan ja parantamaan sinua kiinnostavia aiheita, jotta voisimme tarjota kaikille maailman parasta tietoa.";
"continue-reading-empty-title" = "Ei \U00e4skett\U00e4in luettuja artikkeleja";
"notifications-center-go-to-talk-page" = "Mene keskustelusivulle";
"action-language-accessibility" = "Vaihda kieli";
"reading-themes-controls-accessibility-sepia-theme-button" = "Seepiateema";
"history-clear-confirmation-heading" = "Haluatko varmasti poistaa kaikki tuoreet kohteesi?";
"main-menu-privacy-policy" = "Tietosuojak\U00e4yt\U00e4nt\U00f6";
"notifications-center-subheader-mention-article-talk-page" = "Maininta artikkelin keskustelusivulla";
"reading-list-do-not-keep-button-title" = "Ei, poista artikkelit laitteesta";
"action-retry" = "Yrit\U00e4 uudelleen";
"explore-continue-reading-heading" = "Jatka lukemista";
"featured-widget-description" = "L\U00f6yd\U00e4 parhaat Wikipedian artikkelit, joita yhteis\U00f6mme valitsee p\U00e4ivitt\U00e4in.";
"field-new-password-confirm-placeholder" = "anna uusi salasana uudelleen";
"reading-list-login-subtitle" = "Kirjaudu sis\U00e4\U00e4n tai luo tunnus salliaksesi tallennettujen artikkelien ja lukulistojen synkronoitua laitteiden v\U00e4lill\U00e4 ja tallentaa k\U00e4ytt\U00e4j\U00e4asetuksiisi.";
"places-empty-search-title" = "Etsi Wikipedia artikkeleita maantieteellisill\U00e4 paikoilla";
"top-read-header-with-language" = "%1$@ Wikipedia";
"description-welcome-promise-title" = "Aloittamalla, lupaan etten v\U00e4\U00e4rink\U00e4yt\U00e4 t\U00e4t\U00e4 ominaisuutta";
"reading-lists-delete-reading-list-alert-title" = "Poista %1$d|lista|listaa?";
"action-remove" = "Poista";
"settings-storage-and-syncing-server-sync-footer-text" = "P\U00e4ivit\U00e4 synkronoidut artikkelit ja lukulistat.";
"find-replace-header" = "Etsi ja korvaa";
"talk-page-new-reply-body-placeholder-text" = "Kirjoita vastaus";
"explore-feed-preferences-show-top-read-footer-text" = "Luetuimmat-kortin poistaminen k\U00e4yt\U00f6st\U00e4 poistaa sen k\U00e4yt\U00f6st\U00e4 kaikilla kielill\U00e4.";
"field-new-password-confirm-title" = "Vahvista uusi salasana";
"explore-nearby-placeholder-sub-heading-on-wikipedia" = "Wikipediasta";
"settings-storage-and-syncing-erase-saved-articles-alert-title" = "Poistetaanko kaikki tallennetut artikkelit?";
"explore-feed-preferences-show-picture-of-the-day-title" = "N\U00e4yt\U00e4 P\U00e4iv\U00e4n kuva -kortti";
"empty-talk-page-title" = "K\U00e4ytt\U00e4j\U00e4lle ei ole l\U00e4hetetty viestej\U00e4";
"edit-style-table-view-title" = "Tyyli";
"page-protected-sysop" = "T\U00e4m\U00e4 sivu on t\U00e4ysin suojattu.";
"field-new-password-placeholder" = "anna uusi salasana";
"about-repositories-app-source-license-mit" = "MIT";
"notifications-center-subheader-translate-milestone" = "K\U00e4\U00e4nn\U00f6svirstanpylv\U00e4s";
"explore-feed-preferences-top-read-description" = "P\U00e4ivitt\U00e4in eniten luetut artikkelit";
"welcome-intro-free-encyclopedia-more" = "Lue lis\U00e4\U00e4 Wikipediasta";
"reading-list-sync-enable-button-title" = "Ota synkronointi k\U00e4ytt\U00f6\U00f6n";
"action-thank-user-accessibility" = "Kiit\U00e4 k\U00e4ytt\U00e4j\U00e4\U00e4";
"edit-comment-accessibility-label" = "Lis\U00e4\U00e4 kommenttisyntaksi";
"edit-link-accessibility-label" = "Lis\U00e4\U00e4 linkkisyntaksi";
"reading-lists-article-save-to-disk-failed" = "Laiteraja ylitetty, ei voida synkronoida artikkelia";
"talk-page-new-topic-title" = "Uusi keskustelu";
"wikitext-upload-save-anonymously-or-login" = "IP-osoitteesi tallentuu muokkaushistoriaan. %1$@Kirjautumalla sis\U00e4\U00e4n%2$@ parannat yksityisyytt\U00e4si.";
"wikitext-preview-changes-none" = "Ei esikatseltavia muutoksia.";
"home-more-like-footer" = "Vastaavia artikkeleita kuin %1$@";
"action-cancel" = "Peruuta";
"page-history-revision-size-diff-subtraction" = "Poistettu %1$d|%1$d tavu|%1$d tavua";
"talk-page-new-banner-title" = "Olethan yst\U00e4v\U00e4llinen!";
"notifications-center-empty-checking-for-notifications" = "Tarkistetaan ilmoituksia...";
"wikitext-preview-link-preview-description" = "T\U00e4m\U00e4 linkki vie osoitteeseen '%1$@'";
"insert-media-image-type-setting-frameless" = "Kehykset\U00f6n";
"notifications-push-talk-body-format" = "%1$d %2$@ sivulla %3$@";
"reading-list-unable-to-delete" = "Odottamaton virhe tapahtui poistaessa lukulistaasi. Yrit\U00e4 my\U00f6hemmin uudelleen.";
"settings-storage-and-syncing-erase-saved-articles-button-title" = "Poista";
"settings-clear-cache-ok" = "Tyhjenn\U00e4 v\U00e4limuisti";
"insert-media-image-preview-select-image-action-title" = "Valitse kuva";
"explore-potd-heading" = "P\U00e4iv\U00e4n kuva";
"intermediate-edits-limited-editors-count" = "%1$d+ v\U00e4liss\U00e4 olevaa versiota %2$d|toisen k\U00e4ytt\U00e4j\U00e4n tekem\U00e4n\U00e4|%2$d k\U00e4ytt\U00e4j\U00e4n tekemin\U00e4 ei n\U00e4ytet\U00e4";
"notifications-center-empty-no-messages" = "Sinulla ei ole viestej\U00e4";
"edit-reference-accessibility-label" = "Lis\U00e4\U00e4 viitesyntaksi";
"no-internet-connection-article-reload-button" = "Palaa viimeksi tallennettuun versioon";
"explore-feed-preferences-hide-feed-cards-action-title" = "Piilota kaikki \U201d%1$@\U201d-kortit";
"potd-description-prefix" = "P\U00e4iv\U00e4n kuva: %1$@";
"reading-lists-article-save-to-disk-recovery-suggestion" = "Vapauta laitteen muistitilaa ja yrit\U00e4 uudelleen";
"logged-out-continue-without-logging-in-button-title" = "Jatka kirjautumatta";
"diff-paragraph-moved-direction-up" = "yl\U00f6s";
"edit-summary-choice-fixed-grammar" = "Kielioppia korjattu";
"page-similar-titles" = "Samankaltaiset sivut";
"preference-summary-eventlogging-opt-in" = "Salli Wikimedia-s\U00e4\U00e4ti\U00f6n ker\U00e4t\U00e4 tietoja sovelluksen k\U00e4ytt\U00e4misest\U00e4 k\U00e4ytt\U00f6kokemuksen parantamiseksi.";
"notifications-center-subheader-mention-failed" = "Ep\U00e4onnistunut maininta";
"explore-nearby-heading" = "L\U00e4hist\U00f6n paikat";
"talk-page-info-active-conversations-generic" = "Aktiiviset keskustelut Wikipediassa";
"places-accessibility-show-as-list" = "N\U00e4yt\U00e4 luettelona";
"reference-section-button-accessibility-label" = "Hypp\U00e4\U00e4 l\U00e4hdeosioon";
"button-saved-remove" = "Poista tallennetuista";
"wikitext-upload-save" = "Julkaistaan...";
"explore-feed-preferences-turn-off-explore-tab-action-title" = "Poista Tutki-v\U00e4lilehti k\U00e4yt\U00f6st\U00e4";
"description-help-tips-title" = "Vinkkej\U00e4 kuvauksen luomiseen";
"notifications-center-subheader-email-from-other-user" = "Uusi s\U00e4hk\U00f6posti";
"action-sort" = "Lajittele";
"explore-feed-preferences-turn-on-explore-tab-message" = "Asetukset-painike korvataan Tutki-painikkeella, Asetuksiin p\U00e4\U00e4see napauttamalla mutterin kuvaketta Tutki-n\U00e4kym\U00e4n yl\U00e4laidasta";
"talk-page-new-subject-placeholder-text" = "Aihe";
"saved-reading-lists-title" = "Lukulistat";
"action-undo" = "Kumoa";
"explore-feed-preferences-global-card-footer-text" = "T\U00e4m\U00e4 kortti ei ole kielikohtainen, ja sen poistaminen k\U00e4yt\U00f6st\U00e4 poistaa sen Tutki-sy\U00f6tteest\U00e4si.";
"edit-unordered-list-remove-accessibility-label" = "Poista valittu rivi numeroimattomasta listasta";
"places-filter-no-saved-places" = "Sinulla ei ole tallennettuja paikkoja";
"reading-lists-delete-reading-list-alert-message" = "T\U00e4t\U00e4 toimintoa ei voi kumota. Kaikki artikkelit, jotka on tallennettu vain %1$d|t\U00e4h\U00e4n listaan|n\U00e4ihin listoihin ei tallenneta.";
"explore-feed-preferences-feed-card-visibility-all-languages-on" = "Kaikilla";
"aaald-new-website-reference-archive-url-text" = "Archive.org URL-osoite";
"saved-unsave-article-and-remove-from-reading-lists-message" = "%1$d|T\U00e4m\U00e4n artikkelin tallentamattomaksi j\U00e4tt\U00e4minen poistaa sen|N\U00e4iden artikkelien tallentamattomaksi j\U00e4tt\U00e4minen poistaa ne kaikista niihin liittyvist\U00e4 lukulistoista";
"error-generic-recovery-suggestion" = "Yrit\U00e4 my\U00f6hemmin uudelleen";
"explore-feed-preferences-show-on-this-day-title" = "N\U00e4yt\U00e4 T\U00e4n\U00e4 p\U00e4iv\U00e4n\U00e4 -kortti";
"explore-hide-card-prompt" = "Piilota t\U00e4m\U00e4 kortti";
"description-welcome-concise-sub-title" = "Ideaalisesti yksi rivi, kahdesta kahteenkymmeneen sanaan";
"notifications-center-filters-types-section-title" = "Ilmoitusten tyypit";
"reading-themes-controls-syntax-highlighting" = "Syntaksin korostus";
"explore-feed-preferences-show-featured-article-footer-text" = "Suositeltu artikkeli -kortin poistaminen k\U00e4yt\U00f6st\U00e4 poistaa sen k\U00e4yt\U00f6st\U00e4 kaikilla kielill\U00e4.";
"welcome-intro-free-encyclopedia-more-description" = "Wikipedia on maailmanlaajuinen projekti luoda vapaa tietosanakirja kaikilla maailman kielill\U00e4. \nK\U00e4yt\U00e4nn\U00f6ss\U00e4 kuka tahansa, jolla on Internet-yhteys, voi vapaasti osallistua my\U00f6t\U00e4vaikuttamalla neutraaleihin, siteerattuihin tietoihin.";
"edit-watch-list-learn-more-text" = "Lue lis\U00e4\U00e4 tarkkailulistoista";
"article-read-more-title" = "Samankaltaisia artikkeleita";
"page-history-compare-accessibility-hint" = "Napauta valitaksesi kaksi vertailtavaa versiota";
"reading-lists-article-not-synced-article-limit-exceeded" = "Artikkeliraja ylitetty, ei voi synkronoida artikkelia";
"explore-random-article-sub-heading-from-wikipedia" = "Wikipediasta";
"aaald-small-change-description" = "%1$d|0=Ei tehty pieni\U00e4 muutoksia|%1$d pieni muutos tehty|%1$d pient\U00e4 muutosta tehty";
"explore-feed-preferences-turn-off-explore-feed-alert-action-title" = "Poista Tutki-sy\U00f6te k\U00e4yt\U00f6st\U00e4";
"fetcher-error-generic" = "Jotain meni pieleen. Yrit\U00e4 uudelleen my\U00f6hemmin";
"welcome-explore-tell-me-more-done-button" = "Selv\U00e4";
"explore-feed-preferences-turn-off-explore-tab-title" = "Poista Tutki-v\U00e4lilehti k\U00e4yt\U00f6st\U00e4";
"field-password-confirm-title" = "Vahvista salasana";
"reading-list-create-new-list-description" = "Kuvaus";
"sort-by-recently-added-action" = "\U00c4skett\U00e4in lis\U00e4tyt";
"share-menu-item" = "Jaa\U2026";
"featured-article-empty-title" = "Ei saatavilla olevaa suositeltua artikkelia t\U00e4lle p\U00e4iv\U00e4lle";
"theme-dark-display-name" = "Tumma";
"action-share-accessibility" = "Jaa";
"notifications-center-status-unread" = "Lukematon";
"reading-list-create-new-list-title" = "Luo uusi lista";
"explore-feed-preferences-show-places-title" = "N\U00e4yt\U00e4 Paikat-kortti";
"field-username-placeholder" = "anna k\U00e4ytt\U00e4j\U00e4nimi";
"notifications-center-mark" = "Merkitse";
"diff-single-header-subtitle-bytes-removed" = "%1$d|%1$d merkki poistettu|%1$d merkki\U00e4 poistettu";
"settings-notifications-push-notifications" = "Ilmoitusviestit";
"settings-storage-and-syncing-full-sync" = "Lukulistasi synkronoidaan taustalla";
"replace-textfield-accessibility" = "Korvaa";
"saved-all-articles-title" = "Kaikki artikkelit";
"action-next-revision-accessibility" = "Seuraava istunto";
"reading-list-keep-sync-disabled-additional-subtitle" = "Synkronoinnin poistaminen k\U00e4yt\U00f6st\U00e4 poistaa n\U00e4m\U00e4 artikkelit tunnukseltasi. Jos poistat ne laitteeltasi, niit\U00e4 ei voida palauttaa kytkem\U00e4ll\U00e4 synkronointia takaisin p\U00e4\U00e4lle my\U00f6hemmin.";
"places-filter-top-read-articles" = "Luetuimmat artikkelit";
"unknown-generic-text" = "Tuntematon";
"edit-text-formatting-table-view-title" = "Tekstin muotoilu";
"welcome-explore-new-ways-title" = "Uusia tapoja tutkia";
"reading-list-sync-disabled-panel-message" = "Lukulistojen synkronointi on poistettu k\U00e4yt\U00f6st\U00e4 Wikipedia-tunnuksellesi toisella laitteella. Sen voi kytke\U00e4 takaisin p\U00e4\U00e4lle asetuksia p\U00e4ivitt\U00e4m\U00e4ll\U00e4.";
"reading-list-limit-hit-for-unsorted-articles-button-title" = "Lajittele artikkelit";
"close-button-accessibility-label" = "Sulje";
"article-toolbar-reading-themes-controls-toolbar-item" = "Lukuteemojen ohjaimet";
"notifications-center-notifications-settings" = "Ilmoitusasetukset";
"description-help-about-description" = "Lyhyet kuvaukset tiivist\U00e4v\U00e4t artikkelin aiheen ja auttavat ymm\U00e4rt\U00e4m\U00e4\U00e4n sen yhdell\U00e4 silm\U00e4yksell\U00e4.";
"status-saved-for-later" = "Tallennettu my\U00f6hemp\U00e4\U00e4 varten";
"account-creation-title" = "Luo uusi k\U00e4ytt\U00e4j\U00e4tunnus";
"wikitext-upload-save-terms-name" = "k\U00e4ytt\U00f6ehdot";
"edit-minor-text" = "T\U00e4m\U00e4 on pieni muutos";
"edit-strikethrough-remove-accessibility-label" = "Poista yliviivaus";
"in-the-news-sub-title-from-language-wikipedia" = "Wikipedian kieliversiossa %1$@";
"welcome-send-data-helps-title" = "Auta tekem\U00e4\U00e4n sovelluksesta parempi";
"insert-media-image-position-settings-title" = "Kuvan sijainti";
"welcome-explore-continue-button" = "Aloitetaan";
"account-creation-captcha-obtaining" = "Ladataan uutta kuvavarmennusta...";
"explore-feed-preferences-customize-explore-feed-footer-text" = "T\U00e4m\U00e4n korttityypin piilottaminen lopettaa niiden tarjoamisen Tutki-sy\U00f6tteeseen.";
"wikitext-preview-changes" = "Ladataan esikatselua tehdyist\U00e4 muutoksista...";
"edit-superscript-remove-accessibility-label" = "Poista yl\U00e4indeksin muotoilu";
"diff-single-header-summary-heading" = "Muokkausyhteenveto";
"explore-featured-article-heading" = "Suositeltu artikkeli";
"cc-zero" = "Creative Commons CC0";
"reading-lists-articles-not-synced-limit-exceeded" = "Joitain artikkeleita ei synkronoitu, raja saavutettu";
"relative-date-minutes-ago" = "%1$d|0=Juuri nyt|%1$d minuutti sitten|%1$d minuuttia sitten";
"relative-date-hrs-ago" = "%1$d|0=\U00c4skett\U00e4in|%1$d tunti sitten|%1$d tuntia sitten";
"field-password-placeholder" = "anna salasana";
"aaald-article-insert-new-changes" = "Uudet muutokset";
"edit-direction-down-accessibility-label" = "Liikuta kursoria alasp\U00e4in";
"insert-media-alternative-text-description" = "Tekstin kuvaus lukijoille, jotka eiv\U00e4t n\U00e4e kuvaa";
"explore-feed-customize-accessibility-title" = "Mukauta";
"page-history-anonymous-edits" = "tunnistautumattomilta";
"description-edit-license" = "Muuttamalla artikkelin kuvausta hyv\U00e4ksyn %1$@ ja peruuttamattomasti julkaisen muutokseni %2$@ -lisenssill\U00e4.";
"about-contributors" = "Tekij\U00e4t";
"reverted-edit-view-guidelines-text" = "N\U00e4yt\U00e4 suuntaviivat";
"settings-notifications-trending" = "Nousussa olevat ajankohtaiset tapahtumat";
"notifications-center-go-to-diff" = "Siirry versioon";
"appearance-settings-adjust-text-sizing" = "S\U00e4\U00e4d\U00e4 artikkelien tekstin kokoa";
"potd-widget-description" = "Nauti kauniista p\U00e4iv\U00e4n kuvasta, jonka yhteis\U00f6mme on valinnut.";
"explore-detail-back-button-title" = "Takaisin Tutki-sy\U00f6tteeseen";
"field-email-placeholder" = "esimerkki@esimerkki.org";
"reading-list-unable-to-create" = "Odottamaton virhe tapahtui lukulistaasi luodessa. Yrit\U00e4 my\U00f6hemmin uudelleen.";
"notifications-center-subheader-login-fail-unknown-device" = "Ep\U00e4onnistunut kirjautumisyritys";
"settings-storage-and-syncing-show-default-reading-list-footer-text" = "N\U00e4yt\U00e4 Tallennettu-lukulista erillisen\U00e4 listana lukulistan\U00e4kym\U00e4ss\U00e4. T\U00e4m\U00e4 lista n\U00e4kyy Android-laitteilla.";
"home-themes-action-title" = "Hallinnoi asetuksia";
"page-history-revision-size-diff-addition" = "Lis\U00e4tty %1$d|%1$d tavu|%1$d tavua";
"replace-clear-button-accessibility" = "Tyhjenn\U00e4 korvaus";
"explore-feed-preferences-randomizer-description" = "Tuota satunnaisia \U200b\U200bartikkeleita luettavaksi";
"diff-compare-header-heading" = "Versioiden vertailu";
"reading-list-login-or-create-account-title" = "Kirjaudu sis\U00e4\U00e4n synkronoidaksesi tallennetut artikkelit";
"places-no-saved-articles-have-location" = "Yksik\U00e4\U00e4n tallentamistasi artikkeleista ei sis\U00e4ll\U00e4 sijaintitietoja";
"field-password-confirm-placeholder" = "anna salasana uudelleen";
"page-history-bot-edits" = "boteilta";
"explore-feed-preferences-global-cards-description" = "Ei-kielikohtaiset tietyt kortit";
"empty-diff-compare-title" = "Ei eroavaisuuksia versioiden v\U00e4lill\U00e4";
"edit-unordered-list-accessibility-label" = "Tee valitusta rivist\U00e4 numeroimaton lista";
"insert-media-image-position-setting-none" = "Ei mit\U00e4\U00e4n";
"featured-widget-from-language-wikipedia" = "Wikipedian kieliversiosta %1$@";
"reading-list-add-saved-subtitle" = "N\U00e4m\U00e4 ovat Wikipedia-sovellukseesi tallennettuja artikkeleita. Haluaisitko pit\U00e4\U00e4 ne ja yhdist\U00e4\U00e4 tunnuksellesi synkronoituihin lukulistoihin.";
"action-add-to" = "Lis\U00e4\U00e4...";
"edit-text-formatting-accessibility-label" = "N\U00e4yt\U00e4 tekstinmuotoiluvalikko";
"empty-no-saved-pages-in-reading-list-title" = "Ei sivuja tallennettuna t\U00e4h\U00e4n listaan";
"edit-watch-this-page-text" = "Tarkkaile t\U00e4t\U00e4 sivua";
"reading-list-unable-to-update" = "Odottamaton virhe tapahtui lukulistaasi p\U00e4ivitt\U00e4ess\U00e4. Yrit\U00e4 my\U00f6hemmin uudelleen.";
"explore-another-random" = "Toinen satunnainen sivu";
"reading-lists-default-list-description" = "Oletuslista tallennetuille artikkeleillesi";
"talk-page-new-topic-body-placeholder-text" = "Kirjoita uusi keskusteluviesti";
"notifications-center-go-to-your-talk-page" = "Mene keskustelusivullesi";
"widget-onthisday-placeholder-event-snippet" = "Wikipedia, ilmainen tietosanakirja, siirtyy verkkoon.";
"search-recent-empty" = "Ei viel\U00e4 tuoreita hakuja";
"action-replace" = "Korvaa";
"edit-direction-right-accessibility-label" = "Liikuta kursoria oikealle";
"account-creation-captcha-cannot-see-image" = "Etk\U00f6 n\U00e4e kuvaa? %1$@";
"description-edit-pencil-introduction" = "Muokkaa esittely\U00e4";
"find-infolabel-number-matches" = "%1$@ / %2$@";
"reading-themes-controls-accessibility-brightness-slider" = "Kirkkauden liukus\U00e4\U00e4din";
"reading-list-list-limit-exceeded-title" = "Olet ylitt\U00e4nyt tunnuskohtaisen rajoituksen, joka on %1$d|%1$d lukulista|%1$d lukulistaa tunnusta kohden.";
"explore-because-you-read" = "Koska luit";
"explore-feed-preferences-show-news-footer-text" = "Uutisissa-kortin poistaminen k\U00e4yt\U00f6st\U00e4 poistaa sen k\U00e4yt\U00f6st\U00e4 kaikilla kielill\U00e4.";
"page-protected-can-not-edit-title" = "T\U00e4m\U00e4 sivu on suojattu";
"edit-template-accessibility-label" = "Lis\U00e4\U00e4 mallinesyntaksi";
"reading-list-deleted-accessibility-notification" = "Lukulista poistettu";
"field-email-title-optional" = "S\U00e4hk\U00f6posti (vapaaehtoinen)";
"replace-replace-all-results-count" = "%1$d|%1$d kohde korvattu|%1$d kohdetta korvattu";
"search-title" = "Haku";
"fetcher-error-unexpected-response" = "Sovellus vastaanotti odottamattoman vastauksen palvelimelta. Yrit\U00e4 my\U00f6hemmin uudelleen.";
"notifications-center-filters-read-status-item-title-unread" = "Lukematon";
"welcome-intro-free-encyclopedia-title" = "Vapaa tietosanakirja";
"reading-list-create-new-list-reading-list-name" = "Lukulistan nimi";
"reading-lists-conflicting-reading-list-name-updated" = "Listasi '%1$@' on uudelleennimetty nimelle '%2$@'";
"places-empty-search-description" = "Tutki kaupunkeja, maita, mantereita, luontokohteita, historiallisia tapahtumia, rakennuksia ja paljon muuta.";
"talk-page-new-subject-clear-button-accessibility" = "Tyhjenn\U00e4 aihe";
"about-translators" = "K\U00e4\U00e4nt\U00e4j\U00e4t";
"saved-unsave-article-and-remove-from-reading-lists-title" = "Poista %1$d|artikkeli|artikkelia?";
"description-edit-publish" = "Julkaise kuvaus";
"places-title" = "Paikat";
"notifications-center-mark-as-read" = "Merkitse luetuksi";
"reading-list-keep-button-title" = "Kyll\U00e4, s\U00e4ilyt\U00e4 artikkelit laitteessa";
"talk-page-topic-title" = "Keskustelu";
"page-history-minor-edits" = "pienet muutokset";
"abuse-filter-warning-blanking" = "Osioiden tai kokonaisten artikkelien tyhjennyst\U00e4";
"reading-list-add-generic-hint-title" = "Lis\U00e4t\U00e4\U00e4nk\U00f6 artikkeli lukulistaan?";
"edit-superscript-accessibility-label" = "Lis\U00e4\U00e4 yl\U00e4indeksin muotoilu";
"talk-page-info-active-conversations" = "Keskustelut kieliversion %1$@ Wikipediassa";
"featured-widget-title" = "Suositeltu artikkeli";
"insert-media-image-type-setting-frame" = "Kehys";
"description-help-more-info-description" = "Kuvaukset tallennetaan Wikidataan. Se on Wikimedia-s\U00e4\U00e4ti\U00f6n yll\U00e4pit\U00e4m\U00e4 vapaasti muokattava monikielinen tietokanta, joka toimii Wikipedian ja muiden wikiprojektien tukena.";
"page-issues" = "Sivun ongelmat";
"table-of-contents-close-accessibility-label" = "Sulje sis\U00e4llysluettelo";
"explore-featured-article-sub-heading-from-language-wikipedia" = "Wikipedian kieliversiosta %1$@";
"edit-underline-remove-accessibility-label" = "Poista alleviivaus";
"clear-title-accessibility-label" = "Kumita/putsaa/tyhjenn\U00e4/puhdista";
"explore-nearby-sub-heading-your-location-from-language-wikipedia" = "Sijaintisi kieliversion %1$@ Wikipediassa";
"places-enable-location-title" = "Tutki artikkeleita jotka ovat l\U00e4hell\U00e4 sijaintiasi ottamalla Sijainti toiminto k\U00e4ytt\U00f6\U00f6n";
"about-places-maps-license-details-link-text" = "Lisenssitiedot";
"appearance-settings-theme-options" = "Teeman asetukset";
"explore-feed-preferences-languages-footer-text" = "Kaikkien Tutki-sy\U00f6tekorttien poistaminen k\U00e4yt\U00f6st\U00e4 kaikilla kielill\U00e4 poistaa Tutki-v\U00e4lilehden k\U00e4yt\U00f6st\U00e4.";
"feed-news-notification-button-text" = "Ota ilmoitukset k\U00e4ytt\U00f6\U00f6n";
"edit-summary-choice-linked-words" = "Lis\U00e4tty linkkej\U00e4";
"forgot-password-instructions" = "Saat ohjeet salasanan palauttamiseen s\U00e4hk\U00f6postitse t\U00e4ytetty\U00e4si yhden alla olevista kentist\U00e4";
"notifications-center-checking-for-notifications" = "Tarkistetaan ilmoituksia...";
"button-next" = "Seuraava";
"reading-list-sync-enabled-panel-title" = "Synkronointi on k\U00e4yt\U00f6ss\U00e4";
"diff-single-header-editor-title" = "Muokkaajan tiedot";
"search-recent-clear-confirmation-sub-heading" = "Toimintoa ei voi kumota!";
"settings-notifications-learn-more" = "Lue lis\U00e4\U00e4 ilmoituksista";
"field-captcha-title" = "Kirjoita yll\U00e4 oleva teksti";
"description-published-title" = "Kuvaus julkaistu!";
"welcome-send-data-learn-more" = "Lue lis\U00e4\U00e4 ker\U00e4tyist\U00e4 tiedoista";
"relative-date-hours-ago" = "%1$d|0=\U00c4skett\U00e4in|%1$d tunti sitten|%1$d tuntia sitten";
"two-factor-login-with-backup-code" = "K\U00e4yt\U00e4 yht\U00e4 varmuuskopiokoodeistasi";
"about-title" = "Tietoja";
"search-recent-clear-cancel" = "Keskeyt\U00e4";
"pictured" = "kuvassa";
"in-the-news-currently-trending" = "T\U00e4ll\U00e4 hetkell\U00e4 suosittuja";
"description-help-title" = "Artikkelin kuvauksen ohje";
"diff-thanks-send-button-title" = "L\U00e4het\U00e4 kiitokset";
"reverted-edit-title" = "Kumottu muokkaus";
"saved-default-reading-list-tag" = "T\U00e4t\U00e4 listaa ei voi poistaa";
"explore-feed-preferences-turn-on-explore-tab-title" = "Ota k\U00e4ytt\U00f6\U00f6n Tutki-v\U00e4lilehti?";
"settings-notifications-info" = "Saat ilmoituksia luetuimmista ja nousussa olevista Wikipedian artikkeleista ilmoitusviesteill\U00e4. Ne perustuvat ajankohtaiseen dataan ja kunnioittavat yksityisyytt\U00e4si.";
"aaald-new-website-reference-archive-date-text" = "alkuper\U00e4isversiosta %1$@.";
"welcome-volunteer-send-usage-reports" = "L\U00e4het\U00e4 k\U00e4ytt\U00f6raportteja";
"edit-clear-formatting-accessibility-label" = "Poista muotoilu";
"notifications-push-talk-title-format" = "Uusi %1$@";
"relative-date-hours-ago-abbreviated" = "%1$d t sitten";
"reverted-edit-possible-reasons-subtitle" = "Teit varmasti parhaasi, mutta muokkauksessasi oli puutteita.\n\nKumoamisen syy saattoi olla:";
"saved-search-default-text" = "Hae tallennetuista artikkeleista";
"top-read-widget-description" = "Opi mit\U00e4 maailma lukee t\U00e4n\U00e4\U00e4n Wikipediassa.";
